[{"chapter_number": 1, "text": "Arjuna Vishada Yoga – Yoga of despondency of Arjuna\n\nArjuna the great warrior is overpowered by grief and delusion born out of a sense of attachment to his kith and kin. In his delusory state, he makes several fallacious arguments to support his decision not to fight. This sets the stage for the Lord’s teaching which comprises the rest of the Gita.Below are the main themes of Chapter 1:\n\nVerses 1 – 20\nDescription of the armies and the preparations for the battle.\n\nVerses 21 – 25\nArjuna’s chariot driven to the middle of the battlefield amidst the two armies.\n\nVerses 26 – 28\nArjuna’s change of mind, leading to attachment (rāga)\n\nVerses 25 – 34\nArjuna’s grief on seeing the enormity of the task he is about to undertake (śoka)\n\nVerses 35 – 47\nArjuna’s delusion which stems from his ignorance about the true nature of oneself (moha)\n\n\n<h5>Background</h5>\nThe epic battle of Mahābhārata, fought between the Pāṇḍavas and Kauravas is the scenario in which the Gītā-teaching is imparted. Arjuna, the Pāṇḍava, discovers the problem of saṃsāra in the battlefield. He surrenders to Lord Krishna seeking a solution. Then follows the great teaching.\n\nIn order to attain the wisdom that permeates the Gītā one should go through the following phases in life:\n\n1. One should discover the problem of saṃsāra, for which Gītā happens to be a solution. Unless one discovers the disease, one will not seek medicine.\n2. One should become possessed by a sincere longing (tīvramumukṣā) for freedom from saṃsāra. This alone can lead to committed and fruitful pursuit.\n3. One should realize that one cannot solve this problem independently. The maximum that one can do, as a limited human being, is a rearrangement or a reshaping of the problem.\n4. One should surrender to a Guru seeking his guidance. When surrender to the Guru happens, the ground is prepared for the Gītā-teaching to take place.\n\nThe entire first chapter and the first part of the second chapter are devoted to show these developments.\n\n\n<h5>The problem of saṃsāra</h5>\nAs shown in the first chapter, the problem of saṃsāra can be said to be the problem of attachment (kṛpā or rāga), grief (śoka or viṣāda) and delusion (moha). When one is not happy with oneself, one has to seek external aids. This leads to dependence and attachment. Since the conditions of the depended factors are unpredictable, the very peace of mind of that person is in trouble. A disturbed mind can make only faulty judgments complicating matters further. Thus a vicious cycle is created. This, in short, is the problem of saṃsāra.\n\n\n<h5>Verse details </h5>\nComing to the text, we find, in the first twenty verses, a vivid description of the armies arrayed for battle. After a brief instruction of Duryodhana to his commanders, Bhīṣma, Lord Krishna, Arjuna, and others blow their conches, signaling the commencement of the battle (1 to 20).\n\nAt this fateful moment, Arjuna commands Lord Krishna, his charioteer, to place the chariot in the middle of the army to scrutinize the enemy forces. The mischievous Lord brings the chariot in front of Bhīṣma and Droṇa and asks Arjuna to survey the army (21 to 25).\n\n(Till now Arjuna was convinced that his cousins are unrighteous and he, as a kṣatriya, has to fight the battle to establish righteousness.)\n\nIn a moment of weakness, Arjuna slips from reason to relation. Instead of seeing the violators of dharma, he sees his beloved kith and kin. Naturally, Arjuna is overpowered by attachment. Then follow the twin offshoots of attachment viz. grief and delusion (26 to 30).\n\nIn the next five verses, we see Arjuna expressing his intense grief which shakes him completely. This indicates the extent of his attachment.\n\nVeiled by attachment, his discriminating power becomes inoperative and he commits a series of false judgments. Interestingly enough, Arjuna even quotes the scriptures to support his unreasonable stand. Thus, Arjuna gets caught up in delusion which is depicted from the 36th verse up to the end of the chapter (36 to 47).\n\nIn this way, Arjuna finds himself in the deep sea of attachment, sorrow and delusion (rāga, śoka, moha). Arjuna sincerely wants to get out of this problem. He thinks that solution is to drop the battle. But, one corner of his mind is not convinced by this. At the same time, he has not realized that the problem is too deep for him to solve independently. Hence he doesn’t surrender to Krishna either. Thus caught up in a dilemma, Arjuna sits back on the chariot sorrowfully.\n\nGita 1st Chapter – Main Points\n\nDescription of the armies and the preparations: 1 to 20\nArjuna’s chariot driven to the middle of the armies: 21 to 25\nArjuna’s change of mind leading to attachment (rāga): 26 to 28\nArjuna’s grief (śoka): 25 to 34\nArjuna’s delusion (moha): 35 to 47\n\nSince Arjuna’s grief is the main topic, this chapter is aptly called Arjunaviṣādayoga.\n\n"}, {"chapter_number": 2, "text": "Sankhya Yoga – The Yoga of Knowledge\n\nArjuna acknowledges in the opening few verses that he is confused about his duty and surrenders to the Lord to instruct him about what is good for him. Thereafter, the Lord begins His teaching and by the end of the chapter, we get an exhaustive summary of the entire philosophical content of the Gita. Below are the main themes of Chapter 2:\n\nVerses 1 – 10\nArjunaśaraṇāgati – Arjuna realizes the depth of his problem and knows he cannot solve it by himself. These verses describe Arjuna’s attitude of surrender towards his Guru, Lord Krishna.\n\nVerses 11 – 38\nSāṅkhya-Yoga – Lord Krishna expounds the highest knowledge about the nature of the immortal Self and the impermanence of all other things, including the body and the world.\n\nVerses 39 – 53\nKarma-Yoga – Lord Krishna stresses the importance of doing one’s duty and the way to perform such duty, the way to be a true Karma Yogi through discrimination, dispassion, equanimity and skill in action. Then he glorifies Karma Yoga as a way to come to Sankhya Yoga.\n\nVerses 54 – 72\nSthitaprajñatva-upāya and Sthitaprajña-lakṣaṇa – The Lord describes the characteristics of the one who is firmly established in the Self (Sthitaprajña) and highlights the Sadhanas or practices required to attain such a state, where one lives as a Jivan Mukta.\n\n\n<h5>Background</h5>\nIn the first chapter, Arjuna was shown to be completely immersed in grief (śoka) caused by attachment (rāga) and delusion (moha). Independently analyzing the problem, he comes to the conclusion that withdrawing from the war is the only solution.\n\nIn the beginning of the second chapter we see the turning point in Arjuna. Chastised by Krishna\n\n(2, 3), Arjuna analyses the situation further. This leads to the two important discoveries:\n\n1. His weakness of attachment is a fundamental problem which cannot be solved by superficial methods (9).\n2. He has to surrender completely to a guru to get out of this fundamental problem (8).\n\nThus, Arjuna becomes a śiṣya by surrendering to Lord Krishna. Naturally, Krishna also becomes a guru. Now that the guru-śiṣya relationship has been struck, the teaching can begin (10).\n\n[Once a human being discovers a seeker in him, the guru will be right in front. The vedaantic teaching can take place only between a guru and śiṣya.]\n\nKrishna straightway attacks Arjuna’s idea that war is going to harm Bhīṣma or himself. He points out that all the problems of Arjuna are because of delusion caused by ignorance, for wise men never have a problem (11). Thereafter, Krishna gives different reasons to establish that Arjuna has to fight this war:\n\n1. From the stand point of true nature of Ātmā (ādhyātmika-dṛśṭi), Bhīṣma and others are immortal. Ātmā is never subject to changes in spite of the changes of the body. It is neither a doer nor an enjoyer. Hence, neither is Arjuna a slayer nor is Bhīṣma slain. So, why should he resist to fight? (12 to 25). Even if the Ātmā is impermanent, Arjuna should not lament. Whatever appears will have to disappear and whatever disappears will appear. Hence, one should learn to accept the change. [In fact, change is the beauty of the creation. It looks ugly when our outlook is partial or selfish.] Hence, why should Arjuna grieve for the physical separation from Bhīṣma and others which is inevitable in life? (26 to 30).\n\n2. From the stand point of Kṣatriya’s duty (dhārmika-dṛśṭi), Arjuna can fight if it is necessary to establish order. A kṣatriya must look at the problem not from personal stand point, but from social stand point (31). Hence, why should Arjuna hesitate to fight for a righteous cause? A righteous war is a door to heaven for a kṣatriya (32). If Arjuna avoids war, not only he be shirking his duty and losing heaven, but he will positively incur sin (33). For avoiding sin, at least, Arjuna should fight.\n\n3. Looking at the situation from worldly angle (laukika-dṛśṭi), Arjuna should not withdraw from the war. He will be called a coward by everyone (including the future generation) (34, 36). Shouldn’t Arjuna fight to protect his reputation?\n\nWith these arguments, Lord persuades Arjuna to fight (37, 38) and concludes the first part of his teaching. He calls this sāṅkhya-yoga (39).  [In fact, the first argument which deals with the nature of the Ātmā and the body (ātma-anātma-viveka) alone is the sāṅkhya-yoga.] Hereafter, the Lord enters into buddhi-yoga (karma-yoga). [Though sāṅkhya-yoga is the true solution for sorrow, many are not fit to gain it because of the false idea (moha) that worldly pursuits can solve the problem. So, initially, one has to be allowed to pursue worldly ends. By this, one should discover for oneself that actions and their results cannot give permanent satisfaction. This is dispassion. A dispassionate mind can pursue sāṅkhya-yoga. Thus karma-yoga is introduced as a means to come to sāṅkhya-yoga.]\n\nFirst, the Lord describes the glory of karma-yoga (40 to 46). Then comes the principle of karma-yoga. One can choose one’s action but never the result. The result is dependent on the laws of action. The other factors of the world, known and unknown, may bring a totally unexpected result. One cannot avoid that. Yet inaction will not be a solution (47). No one can completely know the laws of action. Hence, actions are often imperfect in spite of effort. So, one should ever be ready for any result. One can hope for the best, but should be prepared for the worst. When one acts with the above understanding, success and failure lose their capacity to shake him. One does not react, because he is not caught unawares. This equanimity in action is yoga (48). Thus, one can convert the binding karma into a valid teacher. This is skill in action (50). A tranquil mind will soon shed its false value attributed to the world and turns towards the Ātmā (52). When, through Self-knowledge, one gets established in the peaceful Ātmā, he attains liberation (53).\n\nNow, Arjuna becomes curious to know the characteristics of a person who is firmly established in Self-knowledge (sthitaprajña) (54). Krishna answers Arjuna’s question and gives the means of stabilizing the knowledge.\n\nKnowledge cannot be fruitful unless it is stabilized and assimilated. For this, Krishna talks about two important sādhanas (58 to 68). They are the control of the mind and the sense organs and contemplation upon the teaching. By this, the knowledge sets (61). On the other hand, if these are not practiced, the mind and the sense organs will drag a person to the field of sense objects and gradually pull him down spiritually (62, 63).\n\nTalking about the characteristics of a wise man, the Lord points out that the man of Self-knowledge is always satisfied with himself and consequently, he is free from all desires (55). He is independent of the world to be happy. Naturally, he is free from attachment, hatred, desire, anger, fear, elation, depression etc. (56, 57). Though living in the same world, he enjoys a freedom and contentment which is unknown to others. Thus, if the ignorant man can be said to be in darkness with regards to the Ātmā, the wise man is in broad daylight of the Ātmā\n\n(69). The best comparison for the wise man’s mind is the ocean. The ocean is independently full and is unaffected by the rivers, entering or not entering, dirty or clean. Similarly, the wise man’s mind is independently full. It is undisturbed by the favourable and unfavourable experiences, entering or not entering (70). Krishna concludes this topic by glorifying this state as the Brāhmī-state, reaching which one does not get deluded again. He lives life as a jīvan-mukta (liberated while living) even at the far end of this journey. After death, he becomes one with Brahman (nirvāṇam) which is called videha-mukti.\n\n\n\nArjunaśaraṇāgati: 1 to 10\nSāṅkhya-yoga: 11 to 38\nKarma-yoga: 39 to 53\nSthitaprajñatva-upāya and sthitaprajña-lakṣaṇa: 54 to 72\n\nSince sāṅkhya-yoga is the main topic, this chapter is aptly called Sāṅkhya-yoga.\n\n"}, {"chapter_number": 3, "text": "Karma Yoga – Path of Selfless Service\n\nIn Chapter 3 of the Bhagavad Gita, the Lord teaches the importance of action and explains why and how one must act in the world so that the mind and intellect are purified and relieved of their false attachments, thereby making them receptive to the Self-knowledge that was emphasized in the previous chapter. Below are the main themes of Chapter 3:\n\nVerses 1 – 7\nIntroduction\n\nVerses 8 – 20 (First Line)\nKarmayoga\n\nVerses 20 (Second Line) – 29\nThe role of a wise person\n\nVerses 30 – 35\nSummary\n\nVerses 36 – 43\nThe problem of desire and its solution\n\n\n<h5>Background</h5>\nIn the second chapter, the Lord praised Self-knowledge right from the beginning (11, 21, 46) and criticized the karma-kāṇḍa of the Vedas (42 to 45). Thereafter, He asked Arjuna to take to karma (48). This creates a serious doubt in Arjuna and the third chapter begins with this doubt.\n\nArjuna asks—“Oh Lord! You seem to confuse me by contradictory statements. Tell me one—knowledge or karma—which will lead me to Mokṣa” (1, 2).\n\nBhagavān answers that there are two lifestyles called karma-yoga-niṣṭhā (social life) and jñāna-yoga-niṣṭhā (secluded life). One can choose anyone of them as a householder or as a monk (3).\n\n(But there is no choice between karma and knowledge. Whatever lifestyle one chooses, one has to follow relevant karma for purity and then pursue knowledge to discover the freedom that is one’s true nature.\n\nOf these two lifestyles, Krishna gives preference to social life throughout the Gītā. In the Upaniṣads we find the latter emphasized. Choice depends on the maturity of the seeker.)\n\nFrom the 4th to the 7th verse, Krishna condemns inaction and praises an alert and active life. Inaction should be avoided because:\n\n1. Neither purity nor knowledge can be achieved by that (4);\n2. Desires force one to act and inaction will be a suppression (5);\n3. A mind without occupation will be idle. It will brood over sense pleasures. Such a hypocritical mind will soon fall (6). (Also refer II-62, 63)\n\nFrom the 8th to the 20th verse (1st line), Bhagavān deals with one of the most beautiful and important topics of the Gītā viz. karma-yoga.\n\nHaving created the world and the intelligent human beings, the Lord Himself advocated (in the Vedas) the way of life which is karma-yoga. By following this, material and spiritual progress can be attained (10 to 14).\n\nSince it is the teaching of the Lord, the Master of the universe (Svāmī), human being has to take it as a command (niyatam) and obey it as a servant (bhṛtya) of the Lord (8).\n\nWhen we follow the teachings of the Lord, it becomes a gesture of our appreciation for all the gifts and blessings that the Lord has bestowed upon us. Thus, our work becomes a worship or loving offering (yajña) to God. It purifies the mind also (9, 13).\n\nLastly, karma-yoga is necessary to maintain the harmony of the universe upon which we are dependent. The working of the universe being a cyclic process, with the human beings as its important link, one must be aware of one’s responsibility (duty). Thus, karma-yoga is only the duty (kāryam) of a responsible citizen of the world. One who does not discharge it proves himself/herself to be an immature human being (14 to 16).\n\nThus, karma-yoga is to be pursued because:\n\n1. It contributes to material and spiritual progress (yoga).\n2. It is the commandment (niyatam) of the Master of the universe.\n3. It is our grateful offering (yajña) to the Lord, acknowledging His gifts.\n4. It is the only way of maintaining the harmony (dharma).\n(In this chapter, Bhagavān does not talk about kāmya-karma — actions to fulfill the desires. This shows that true karma-yoga does not involve kāmya-karma. Hence a seeker must gradually reduce kāmya-karma, even to become a true karma-yogī.)\n\nKarma-yoga ultimately leads one to liberation through the stages of purity (śuddhi), enquiry (vicāra) and knowledge (jñānam) (17, 18). Krishna concludes the topic by citing the example of Janaka who successfully pursued knowledge while remaining in karma-yoga-niṣṭhā (social life) (20, 1st line).\n\nFrom the 20th (2nd line) to the 29th verse, the Lord talks about the role of a wise man in the society, taking Arjuna as one. Any person with a higher status or knowledge (śreṣṭha), can influence others positively or negatively. Hence, even though Arjuna might not benefit from this war, he has to fight as kṣaṭriya’s duty and set an example to others. Else, he will be responsible for anarchy in his own time as well as in the future (22 to 25).\n\nThus, both the wise and the ignorant should act — the former for teaching others, and the latter, for purity. The only difference is that the former will be detached while the latter won’t be (27 to 29).\n\nThe 30th verse summarizes karma-yoga, giving five conditions:\n\n1. Keep the spiritual goal.\n2. Offer all actions to the Lord.\n3. Don’t be concerned about the result.\n4. Be free from possessiveness; and\n5. Be calm.\n\nOne who follows karma-yoga reaches the goal of life and the other is lost (31, 32).\n\nLikes and dislikes (rāga-dveṣa) born of habits (vāsanas) pull a person astray. Still, a person should not go by what he likes to do but what he has to do (duty), even if it involves difficulties (33 to 35).\n\nAs an answer to Arjuna’s question (36), Krishna elaborately discusses the problem of kāma-krodha (rāga-dveṣa). They are the real enemies of a seeker (37). Clouding the knowledge, they force a person to run after endless insatiable desires and take away all the chances of peace and progress (38, 39). The senses, the mind, and the intellect are the base of desires. They have to be taken care of (40, 41).\n\n(Durvāsanās should be replaced by śubhavāsanās by practice. False values should be replaced by right ones through discrimination.)\n\nOnce kāma becomes weak, one can discover the Ātmā, which is beyond the senses, the mind, and the intellect and thus destroy kāma for good (42, 43).\n\n\n\nSince karma-yoga is the main topic, this chapter is called Karma-yoga.\n\n"}, {"chapter_number": 4, "text": "Jñāna Karma Sanyāsa Yoga – Approaching the Ultimate Truth\n\nHaving emphasized the importance of action in the previous chapter, here the Lord begins a gradual transition to the superiority of pursuing knowledge. Virtues of the man of knowledge are pointed out and a variety of worldy sadhanas are described as being rooted in action. But the Lord ends the chapter by exhorting Arjuna to action since right actions, as described in this chapter, are essential for readying the mind for knowledge. Below are the main themes of Chapter 4:\n\nVerses 1 – 8\nGītā-stuti and avatāra\n\nVerses 9 – 15\nKnowledge of avatāra and its result\n\nVerses 16 – 24\nThe wisdom of seeing inaction in action and vice versa (The characteristics of the wise)\n\nVerses 25 – 34\nThe glory and the means of knowledge\n\nVerses 38 – 42\nBenefit of knowledge 35 to 37\n\nVerses 38 – 42\nQualifications and disqualifications\n\n\n<h5>Background</h5>\nLord Krishna dealt with karmayoga and sāṅkhyayoga in the third and second chapters respectively. These two yogas are not newly introduced by Krishna. It has been initiated by the Lord in the beginning of the creation itself through the karma-kāṇḍa and jñāna-kāṇḍa of the Vedas. Thus, this is an ancient wisdom which has stood the test of time.\n\nKrishna begins the fourth chapter by referring to the above aspect so that Arjuna will have reverence for Gītā. The Lord points out that He initiated the lineage of Vivasvān (Lord Sun), Manu, Ikṣvāku, and others in the beginning of the creation (through the Vedas). It is the same ancient vedic wisdom which is being revived by Lord Krishna through Arjuna in the form of the Gītā because it had declined by that time (2, 3).\n\nNow, Arjuna wonders how Krishna, who is his contemporary, can be the initiator of the ancient vedic wisdom (4). As an answer to this question, Krishna introduces the topic of avatāra (5 to 8). [We are born because of our own karma (vyaṣṭi-karma) as well as the total karma of the world (samaṣṭi-karma). In the case of the Lord, His own karma is not there. Thus the karma of the world becomes the cause for the birth of the Lord.] The evil actions of the wicked and the noble worship of the saints necessitates the manifestation (avatāra) of the Lord to punish the former and bless the latter. Thus the Lord establishes dharma in the universe (7, 8). But, since this birth is only through māyā, it is apparent. Hence it does not affect the true birthless nature of the Lord (6). Moreover, since māyā is under the control of the Lord, His omniscience, omnipotence, etc. are not veiled. He remembers all the past as well as His true nature. It is from this standpoint that Krishna says “I initiated the vedic tradition.”\n\nFrom the 9th to the 15th verse, the Lord talks about His true nature and its knowledge. Though the Lord seems to be active, He is free from all activities and their results (13, 14). He is akartā and abhoktā. One who recognizes this nature of the Lord also becomes liberated i.e., becomes free from actions and their results (9). (This shows that the true nature of the Lord and jīva is one and the same.) But, being interested in the pursuit of various types of means and ends, one does not turn to this liberating knowledge (12). Still, some people manage to become one with the Lord by freeing the mind from attachment, hatred and fear, by surrendering to the Lord, and by finally gaining Self-knowledge (10). Lord gives whatever the devotee seeks (11).\n\nFrom the 16th to the 25th verse, Krishna gives the knowledge of the nature of action and inaction and the characteristics of the person of such a knowledge. Having talked about the rareness of such a knowledge (16, 17), the Lord defines a wiseman as one who sees actionlessness (of the Self) amidst the activities (of the body) as well as (the potential) action in the seemingly inactive body (18).\n\n(The idea is that the wise man accepts activities at the level of body because no one can expect relaxation at the body level. The very process of life is the continuous function of the body. One should only discover inner relaxation even amidst the activities by recognizing the true ‘I’ as the actionless Self. Therefore, true and complete renunciation is possible only through knowledge.)\n\nIn fact, the wise man never sees anything other than Brahman, that being the truth of all (25). Whether his body is active (20) or not (21), he is not affected. He is self-sufficient, contented, independent, equanimous, and free from fancies, desires, expectations, attachments, and jealousy. His actions are meant for the worship of the Lord which uplifts the humanity (22, 23).\n\nFrom the 25th to the 34th verse, the Lord talks about the superiority of knowledge over all the other sādhanas and the way of getting that knowledge. Various sādhanas are compared to yajñas. They are: Brahmajñāna-yajña, deva-yajña, viṣayabhoga-yajña, dama-yajña, śama-yajña, prāṇāyāma-yajña and āhāraniyama-yajña. All sādhanas lead one to liberation by preparing the mind. But, being the direct means to liberation, Brahmajñāna-yajña is superior to all (33). To get this knowledge one should approach a guru who is established in the Truth (Tattva-darśi) and who has the necessary language to communicate it (jñānī). Such a teacher must be approached with humility, faith, and reverence and asked for this knowledge. Instructed by them through the scriptures, one gains knowledge; not otherwise (34).\n\nFrom the 35th to the 37th verse, Krishna talks about the benefit of this knowledge. Gaining the knowledge, one will not get into delusion once again. For, he sees everything in the Lord as well as in him (i.e., he recognizes his identity with the Lord) (35). By this boat of knowledge one crosses over the ocean of sin however vast it may be (36). Like a blazing fire, this knowledge reduces to ashes (renders inoperative) all the karmas (37). Hence, knowledge is the greatest purifier. (All other sādhanas can produce puṇya which itself is a bondage. Moreover, no other sādhana can destroy ignorance which is the root cause of all sins.) That seeker who has purified the mind will soon attain knowledge by the teaching of a guru (38).\n\nIn the concluding verses (38 to 42), Bhagavān talks about the qualifications and disqualifications with regard to Self-knowledge. One who has faith in the guru and the śāstra, sense-control, and a sincere desire for knowledge will gain the knowledge (39). On the other hand, one who is ignorant, faithless, and doubting is doomed. He cannot enjoy anything in the here or in the hereafter (40). Therefore, “Arjuna! Eliminate all doubts regarding the validity of these spiritual pursuits, and resort to karmayoga”, advises Lord Krishna (42).\n\nKarmas do not bind one who is ultimately established in the doubtless knowledge of the Self (41). This is freedom through knowledge in spite of action — jñānakarmasannyāsa.\n\n\n\n1. Gītā-stuti and avatāra: 1 to 8\n2. Knowledge of avatāra and its result: 9 to 15\n3. The wisdom of seeing inaction in action and vice versa (The characteristics of the wise): 16 to 24\n4. The glory and the means of knowledge: 25 to 34\n5. Benefit of knowledge: 35 to 37\n6. Qualifications and disqualifications: 38 to 42\n\nSince the renunciation of all activities through the knowledge of the actionless ‘I’ amidst the activities of the body is the main topic here, this chapter is called Jñānakarmasannyāsa-yoga.\n\n"}, {"chapter_number": 5, "text": "Karma Vairagya Yoga  – Action and Renunciation\n\nThis chapter stands as a bridge between the action-oriented life extolled by the Lord in the previous two chapers and the life of contemplation that follows in the next. The emphasis here is on renunciation but the Lord makes it clear that this is a state of mind and explains the qualities of a true renunciate. Below are the main themes of Chapter 5:\n\nVerses 1 – 6\nThe two lifestyles sāṅkhya and yoga\n\nVerses 7 – 12\nKarmayoga and its phalam\n\nVerses 13 – 21\nJñānakarmasannyāsa\n\nVerses 22 – 23\nVairāgyam (detachment)\n\nVerses 24 – 26\nVidehamukti\n\nVerses 27 – 29\nInstruction on meditation\n\n\n<h5>Background</h5>\nIn the fourth chapter, Lord Krishna talked about knowledge and renunciation. He referred to the wiseman as one whose karmas are burnt by the fire of knowledge (IV-19). He glorified the wiseman as one who is free from possessions, whose only activity is the maintenance of the body\n\n(IV-21), and who is happy with anything that comes due to prārabdha-karma (IV-22). Evidently, these are the signs of a monk. At the same time, Krishna concludes the chapter by advising Arjuna to take to action (IV-42). Naturally, Arjuna is not able to reconcile Krishna’s various statements.\n\n(In fact, secluded life and active life are only two lifestyles. The first is called āśrama-sannyāsa [sānkhya, in this chapter] and the latter is called karma-yoga [yoga, in this chapter]. In both the lifestyles, one is identified with the equipments. He is a kartā, and hence a saṃsārī. This shows that lifestyle itself cannot give liberation. When Self-knowledge is gained, one discovers that he is akartā, abhoktā and hence asaṃsārī. Thus, the renunciation of body-identification is true sannyāsa which is called jñānakarma-sannyāsa. This sannyāsa can coexist with active life because it is mental renunciation. But āśrama-sannyāsa cannot co-exist with active life because it is physical renunciation. Krishna is advising Arjuna to remain in the society and attain the goal of jñānakarma-sannyāsa. But Arjuna mistakes the sannyāsa as āśrama-sannyāsa and sees contradiction in Krishna’s teaching.)\n\nSo the chapter begins with Arjuna’s doubt as to how a person can remain in duty and be free from actions at the same time (1). Krishna introduces the two lifestyles once again (it was discussed in III-3) and says that either of the lifestyles can help a person in getting mokṣa (through knowledge). What is necessary in both lifestyles is a relative freedom from rāga and dveṣa which is an important condition for Self-knowledge. Of these two, Krishna recommends active life as ideal for a common man. As the Lord Himself points out, a secluded life is difficult to pursue without maturity (2 to 6).\n\nIn the next six verses, the Lord talks about karmayoga and the stages of progress. A karmayogī dedicates all his physical and mental actions to the Lord without concern for the result. Because of this attitude, the results do not cause any reactions in his mind. Gradually, he develops self-control and ultimately discovers his true nature which is the same in all beings. (Of course, this is accomplished through the teaching of a guru alone.) This is called jñānakarma-sannyāsa (7 to 12).\n\nIn the following verses (13 to 21), Krishna discussed the characteristics of a wiseman and his wisdom. Since he has discovered his identity with the pure Self, his nature is the same as that of the Self. In His presence all the organs function. Neither does He act nor does He instigate anyone. According to their nature, the organs act and reap results. He is beyond good and evil results.\n\nStill, because of ignorance, one is deluded (15). When Self-ignorance is destroyed by Self-knowledge, Brahman, which is the true nature, becomes evident (16).\n\nBeing spontaneously established in Brahman through the pursuit of śravaṇam, mananam, and nididhyāsanam, these wisemen revel only in Brahman. Thus, freed from all impurities, they attain videhamukti from where there is no return (17). They recognize the one homogeneous awareness-existence which is behind all beings as their substratum (18). Thus, having discovered the identity with the defectless, ever unaffected Brahman, they overcome mortality here itself (19). Though prārabdha brings favorable and unfavorable situations, these spontaneous, delusion-free wisemen are neither elated nor depressed (20). Detached from the world and established in Brahman, they enjoy infinite ānanda (21).\n\nIn the next two verses, the qualification of vairāgyam is stressed. Unless a seeker gets detached from sensual pleasures, he cannot attain infinite ānanda. A discriminative seeker who knows the impermanence of these contact-born pleasures will not indulge in them (22). And, one who can restrain the impulse of kāma (desire) and krodha (anger) alone is a man of self-control fit to enjoy life (23).\n\nNow (24 to 26) the Lord talks about videhamukti. Jīvanmuktās who revel in themselves, who are pure-minded, who love all beings, and who have doubtless knowledge of the Ātmā attain oneness with Brahman (videhamukti) at the fall of the body.\n\nHaving clarified Arjuna’s doubt, Krishna gives a brief reference to meditation in the last three verses which will be discussed elaborately in the next chapter.\n\n(Though doubtless knowledge can be attained by śravaṇam, and mananam, the habitual notion that “I am the body” does not allow the knowledge to manifest as joy. Hence one has to assimilate this teaching by dwelling upon it, which is called nididhyāsanam).\n\nHaving removed all (thoughts of) sense objects, having withdrawn the sense organs, having regulated the breathing, and freed from desire, fear, and anger, one should meditate with a desire for mokṣa. Such a yogī (meditator) becomes liberated forever (27, 28).\n\nKnowing the Lord who is the receiver of all sacrifices, who is the supreme Lord of all worlds, and who is the friend of all beings the wiseman attains peace (29).\n\n\n\n1. The two lifestyles sāṅkhya and yoga: 1 to 6\n2. Karmayoga and its phalam: 7 to 12\n3. Jñānakarmasannyāsa: 13 to 21\n4. Vairāgyam (detachment): 22 to 23\n5. Videhamukti: 24 to 26\n6. Instruction on meditation: 27 to 29\n\nSince the main topic is sannyāsa (renunciation), this chapter is called Sannyāsa-yoga.\n\n"}, {"chapter_number": 6, "text": "Dhyana-yoga – The Science of Self Realization\n\nThis chapter provides practical methods of meditation for one who has purified the mind by diligently engaging in karma-yoga described in the previous chapters. For such a seeker, a life of contemplation is suggested along with an assurance that the path of meditation inevitably leads to the ultimate goal of Realization whether it be in the current life or a future one. Below are the main themes of Chapter 6:\n\nVerses 1 – 9, 16, 17\nBahiraṅga-sādhanā\n\nVerses 10 – 15\nAntaraṅga-sādhanā\n\nVerses 18 – 32\nArjuna’s change of mind, leading to attachment (rāga)\n\nVerses 33 – 36\nDhyāna-pratibandha and parihāra\n\nVerses 37 – 45\nYogabhraṣṭa\n\nVerses 46 – 47\nYogistuti (Praise of the yogī)\n\n\n<h5>Background</h5>\nLord Krishna introduced the topic of meditation towards the end of the last chapter. Being an important topic, Krishna spends almost the whole of this chapter dealing with meditation. [Here, meditation is upon the Lord as the very Self (Ātmā) of the meditator. This is meant to assimilate the Self-knowledge gained from the guru’s teaching. The conditioning that “I am the body” will go only with the assimilation of the Self-knowledge. Assimilated Self-knowledge alone can express as ānanda.]\n\nKrishna talks about five important topics on meditation. They are:\n1. Bahiraṅga-sādhanā — Those disciplines to be followed throughout daily life which influence one’s meditation.\n2. Antaraṅga-sādhanā — Those disciplines to be followed immediately before meditation.\n3. Dhyāna-svarūpam — Nature of meditation.\n4. Dhyāna-phalam — Result of meditation.\n5. Dhyāna-pratibandha-parihārau — Obstacle and remedy.\n\nBahiraṅga-sādhanā\n\nAt the outset, the Lord indicates the role of karmayoga in meditation by praising the karmayogī (1, 2). Karmayoga, being a conscious way of life, helps one in getting self-control. It converts an extrovert mind into a contemplative mind. Once this is achieved, one should try to lead a quieter life, because active life becomes an obstacle to meditation (3). Total detachment is the characteristic of a contemplative mind (4).\n\nIncidentally, Krishna highlights two important values viz. self-confidence and self-control. One who lacks these two finds himself to be an obstacle for any pursuit. On the other hand, one who enjoys the above two virtues finds himself to be supporting force in every field (5, 6). Soon he is established in the vision of the Ātmā, the vision of equality (7 to 9).\n\nKrishna mentions a few other disciplines also, like moderation in eating, sleeping, working, and resting (16, 17).\n\nAntaraṅga-sādhanā\n\nThe meditator has to choose a secluded, undisturbed place for meditation (10). In that spiritually and physically pure place, he has to fix the seat which is neither too high nor too low, neither too soft nor too hard (11). Holding the body, neck, and head erect, he has to fix the sight on the tip of his nose, as it were (i.e., the eyes are half-closed) (13). Next, the meditator should withdraw the mind and sense organs from all other activities. The breathing also should be maintained even (refer V-27). With a calm, withdrawn, undisturbed, tension-free, and one-pointed mind, the meditator should meditate upon the Lord, the Ātmā (12, 14).\n\nDhyāna-svarūpam and Phalam\n\nMeditation is nothing but abidance of the withdrawn mind in the Ātmā (18). Having given up all desires and having restrained the senses through the mind, one should gradually bring back the mind with the help of the discriminative intellect, step by step. Once the mind is made to abide in the Ātmā, there should be no other thought (25). Though the mind may get distracted, one has to bring it back from the respective fields to one’s own Ātmā (26).\n\n(All this presupposes a clear understanding of Vedānta. Everything, including thoughts, is an object of the Ātmā, the Awareness. The Ātmā is not an object for me to be thought of, or to be experienced. It is the very “I”. Thus, to knock off all expectations and struggles and to abide as the Ātmā with the knowledge that “I am the Ātmā” is true meditation.)\n\nThus, constantly abiding in the Ātmā, the meditator comes to enjoy permanent peace which culminates in the attainment of liberation (videhamukti) (15). He enjoys an everabiding mind which is completely satisfied with the discovery of the Ātmā (20). Since his ānanda is not sensual, it transcends all the limits. Having discovered this inner fullness, he never loses sight of his true nature (21, 27, 28). Neither does he consider any other gain to be superior, nor is he shaken by even the greatest loss (22). This infinite ānanda will never be lost because this was never gained. It was veiled by the false notion that “I am sorrowful”. Once this is removed, the inner ānanda becomes evident. Thus, this is more a dissociation from sorrow rather than association (23). (This alone is known as jīvanmukti.) Seeing the Ātmā in all beings, and all beings in the Ātmā, he gets estabilshed in the vision of equality (29). This vision of the Ātmā alone is the vision of the Lord, because the Ātmā is not different from the Lord. Thus the meditator is ever established in the Lord inspite of his activities (30, 31). Being established in the Ātmā, he looks at all bodies including his body with the same attitude of detachment. Hence he is free from selfishness and is spontaneously established in dharma. He is a saint (32).\n\nDhyāna-pratibandha-parihārau\n\nNow, Arjuna puts a question regarding an obstacle to meditation. It is the problem of mental restlessness or extrovertedness. Because of this, one finds it difficult to meditate and assimilate the Self-knowledge. This frustrates Arjuna’s mind and he asks for a solution (33, 34).\n\nKrishna gives two methods to solve this problem. They are detachment and practice. When the mind is extrovert because of desires, one has to remove it by seeing the futility of desires and their fulfillment. This is detachment. Even a detached mind can be restless because of past habits. This has to be gradually removed by consistent practice alone. Thus, mental discipline requires determination and patience (35, 36).\n\nStill, Arjuna feels diffident and he, somehow, thinks that liberation is not possible in one life. He desperately asks Krishna—“What happens to that seeker who has fallen from meditation? Does he not perish like a scattered cloud?” (Arjuna feels that the meditator has no puṇya, because he has not done any karma. He has failed to achieve liberation also. Thus being deceived of puṇya and mokṣa, he must face an unfortunate future, according to Arjuna.) Not being able to accept this, Arjuna surrenders to Krishna seeking clarification (37 to 39).\n\nKrishna consoles Arjuna by asserting that a spiritual seeker can never have a bad lot (40). The very meditation is a puṇyakarma capable of giving heaven and later an ideal birth for the continuation of the spiritual pursuit. The yogabhraṣṭa (one who has fallen from the path of spirituality) is reborn in a cultured, prosperous family, or may be, even in the family of a saint (41, 42).\n\nHaving got such a birth, he gets associated with the previous wisdom at a very early age (43). Irresistibly drawn by the past habits (saṃskāras), he find his spiritual urge suddenly growing from a small flame to a huge conflagration (44). Committing his entire life to the spiritual pursuit and supported by the saṃskāras of all the previous lives, he effortlessly fulfils his mission in life (45).\n\nKrishna concludes this chapter by praising the meditator in general (46) and praising the meditator of Krishna–paramātmā (Brahmātman) in particular.\n\n\n\n1. Bahiraṅga-sādhanā: 1 to 9, 16, 17\n2. Antaraṅga-sādhanā: 10 to 15\n3. Dhyāna-svarūpam and dhyāna-phalam: 18 to 32\n4. Dhyāna-pratibandha and parihāra: 33 to 36\n5. Yogabhraṣṭa: 37 to 45\n6. Yogistuti (Praise of the yogī): 46, 47\n\nSince the main topic here is meditation, the chapter is called Dhyāna-yoga or Ātmasaṃyama-yoga (mastery of the mind).\n\n"}, {"chapter_number": 7, "text": "Jnana Vijnana Yoga – Knowledge of The Ultimate Truth\n\nThe middle set of 6 chapters beginning with this one are an exposition of the Supreme Reality and how it seemingly manifests as the world we perceive. Here the Lord describes His so-called lower and higher natures and describes the different types of devotees. Those who are attracted to limited, worldly results which are part of His lower nature are granted those desires by His grace but the few who aspire to His higher nature can achieve oneness with Him. Below are the main themes of Chapter 7:\n\nVerses 1 – 3\nIntroduction to the knowledge of God and the glory of that knowledge\n\nVerses 4 – 12\nNature of God\n\nVerse 13\nCause of saṃsāra\n\nVerses 14 – 19\nBhakti, the remedy for saṃsāra\n\nVerses 20 – 26\nSakāma-bhakti (devotion for material ends)\n\nVerses 27 – 30\nNiṣkāma-bhakti (devotion for spiritual end)\n\n\n<h5>Background</h5>\nIn the first six chapters of Gītā, Lord Krishna discussed the nature of the individual, karmayoga, etc. predominantly. In the following six chapters, the Lord will predominantly discuss the nature of God, worship of God with attributes (upāsanā), etc. The individual effort was emphasized in the previous section. It will be the grace of the god that will be emphasized hereafter. In short, all these are necessary to achieve the goal of liberation.\n\nIn the first three verses, Krishna introduces the topic and its glory. Surrendering to God, whoever worships Him along with His attributes will ultimately discover the attributeless God (1). The knowledge of God with attributes, as different from oneself is called jñānam, and the knowledge of God as identical with oneself is called vijñānam. This is the highest knowledge because, the intellectual quest of a person finds its fulfillment in this knowledge (2). The very fact that the number of people who attempt and succeed in gaining this knowledge is very small shows the subtlety and rarity of this knowledge (3).\n\nFrom the 4th to the 11th verse, Krishna talks about the nature of God. God has two aspects known as the highest nature (parā-prakṛti) and the lower nature (aparā-prakṛti). The lower nature has eight divisions — five subtle elements, cosmic ego, cosmic intellect, and the unmanifest (4). [This is called lower because it is changing, inert, finite and dependently existent.] The higher nature is the consciousness behind every body and that alone sustains the entire creation (5). [This is called higher because it is changeless, conscious, infinite and independently existent.] From this God alone comes the entire creation which consists of conscious and inert aspects (jīva and jagat). He alone sustains the creation and resolves it (6). In fact there is no creation from Him and He alone is the very essence of everything (7 to 11). Being the material cause of everything, God is independent of everything and everything is dependent on Him (12).\n\nIn the 13th verse, the Lord traces the causes of all problems (saṃsāra). Being deluded by the creation which is the product of three guṇas (of aparā-prakṛti) one fails to know the higher nature (parā-prakṛti) of the Lord.\n\nThe divine māyā (power of delusion) consisting of three guṇas cannot be conquered by anyone by one’s own effort. Hence the Lord gives the only solution possible — “only those who surrender to me cross over this māyā” (14).\n\nIn the next two verses, Krishna divides the entire humanity into five groups. The lowliest of those are those non-believers who do not accept or pursue the Lord. Leading a life governed by their own desires and taking to devilish nature, such people are completely lost in māyā. The others, though they are devotees, worship Lord with different attitudes due to different levels of maturity. Thus ārta is one who worships the Lord when he is in distress. Arthārthī is one who worships the Lord for material prosperity. Jijñāsu, who is discriminative enough to discern the limitation of everything else, seeks the Lord through knowledge. Jñānī is one who has reached the destination of his life’s journey by discovering his identity with the Lord (15, 16).\n\nIn the next three verses, the Lord talks about the superiority of the wise-devotee. His devotion is permanent and undivided. He loves the Lord has himself because he does not have the dualistic notion. Naturally, the Lord also loves the devotee as Himself (17). Then the Lord promises the highest goal for the wise man of non-dualistic vision [because fullness is possible only in non-duality] (18). Such a vision is achieved by preparing oneself through many births and rare those blessed ones (19).\n\nIn the following four verses, the Lord talks about other devotees who worship the Lord but seek various ephemeral ends. They look upon the Lord as the bestower of health, wealth, power, etc., and they seek those ends through rituals and vows (20). Still the Lord, out of compassion, fulfills their prayers (21, 22). But the Lord warns that everything except God is finite (23).\n\nThen the Lord reveals His true nature [which is identical with the seeker’s nature and which is to be gained in terms of knowledge]. He is ever evident, imperishable, unsurpassed (24) and unborn. Still people, deluded by māyā, mistake the Lord as the person subject to birth, etc. (25). Being of the nature of one non-dual awareness, God alone knows everything belonging to the past, present and future. God never becomes the object of knowledge (26).\n\nConcluding this topic, Krishna mentions the stages of devotion. Because of the fundamental self-ignorance no one can avoid desires in the initial stages of life. Naturally he will be ārta and arthārthī (27). When he worships the Lord, his mind becomes purified and slowly desires become less. He becomes a jijñāsu (28). Now, his attention turns towards knowledge and he pursues it, surrendering to the Lord. Soon he becomes jñānī knowing all about Brahman, karma, adhyātma, adhibūta, adhidaiva and adhiyajña. [He knows both the parā-prakṛti and aparā-prakṛti of the Lord.] Being established in his knowledge, he does not lose sight of the Lord even at the time of death (29, 30). [Thus jñāni-bhakta enjoys both jīvanmukti and videhamukti.]\n\n\n\n1. Introduction to the knowledge of God and the glory of that knowledge: 1 to 3\n2. Nature of God: 4 to 12\n3. Cause of saṃsāra: 13\n4. Bhakti, the remedy for saṃsāra: 14 to 19\n5. Sakāma-bhakti (devotion for material ends): 20 to 26\n6. Niṣkāma-bhakti (devotion for spiritual end): 27 to 30\n\nSince the knowledge of saguṇa-īśvara (jñānam) and that of nirguṇa-īśvara (vijñānam) are highlighted in this chapter, it is called jñānavijñāna yoga.\n\n"}, {"chapter_number": 8, "text": "AkṣaraBrahma-yoga – The Imperishable Brahman\n\nThe previous chapter concluded by introducing certain technical terms and this one begins with an explanation of those. It then details various spiritual practices undertaken by those who desire to merge with the Supreme. This chapter also describes the two paths followed by the “jiva” after it leaves the body – one being the path of eventual return (to this world) and the other being the path of no return (krama-mukti).\nBelow are the main themes of Chapter 8:\n\nVerses 1 – 4\nDefinition of the terms Brahman, adhyātma, karma, adhibūta, adhidaiva and adhiyajña\n\nVerses 5 – 14\nThe significance and the method of remembering the Lord at the time of death\n\nVerses 15 – 22\nComparison between two types of goals — God and world\n\nVerses 23 – 27\nThe bright and dark paths\n\nVerses 28\nGlory of upāsanā\n\n\n<h5>Background</h5>\nLord Krishna concluded the seventh chapter by gloriying jñāni-bhakta as one who knows Brahman, adhyātma, karma, adhibūta and adhiyajña (i.e., the complete nature of God consisting of parā and aparā-prakṛti). He remembers the God at the time of death also.\n\nWith the desire to understand the above new terms, Arjuna asks seven questions to Krishna. The eighth chapter begins with these questions — the first six dealing with the six terms beginning with Brahman and the last one dealing with the thought of a person at the time of death (1, 2).\n\nLord Krishna answers — Brahman is the imperishable Truth, Adhyātma (or ātman) is the same Brahman behind the individual equipments. Karma refers to all actions which are the cause for the birth of all beings (3).\n\nAdhibhūta is the entire perishable, inert universe. Adhidaiva is the Hiraṇyagarbha who blesses all the organs of of all beings. Adhiyajña is the Lord as the presiding deity of all the actions of the individual (4).\n\nFrom the 5th verse till the end of this chapter, Lord Krishna elaborately answers the last question i.e., how to remember the Lord even at the time of death.\n\nWhatever be the predominant thought pattern at the time of death, that determines the place of the rebirth as well as the type of rebirth (6). Hence, if a person yearns for the Lord at the time of death, his rebirth will be conducive for the pursuit of the Lord in which he will naturally be successful (5). [It is said that those who are saguṇa-upāsakas will go to Brahmaloka. They will attain liberation by gaining knowledge from Brahmā, the creator himself. This is called krama-mukti]. But the thought pattern at the time of the death is determined by the predominant thought pattern throughout one’s life. Hence, Krishna asks to remember God all the time so that we will remember Him at the time of death also (7). Though it may appear difficult, one can succeed in this by constant effort and sincere practice (8).\n\nFrom the 9th to the 13th verse, Krishna describes elaborately the practice of upāsanā at the time of death. One should control the organs of perception as well as action. Then by the skill of yoga-practice, prāṇa has to be withdrawn (through the suṣumnā-nāḍī) to the top of the head between the eyebrows. Then, he should withdraw the mind back to the heart, its source. With such a mind he should meditate on oṅkāra or any chosen deity with all devotion. He attains God who is omniscient, eternal, the ruler, subtler than the subtlest, the sustainer of all, incomprehensible, effulgent, and beyond ignorance. All scriptures talk about Him alone. All dispassionate seekers reach Him alone. All disciplines are for attaining Him alone. He is the ultimate goal of upāsakas.\n\nFor a person who is sincerely committed to the practice of mediation of God and whose devotion is undivided, God is easily attainable (14).\n\nThen the Lord compares two types of goals, i.e., God and the world. Nobody can put the end to the cycle of birth by reaching higher lokas (worlds) or by acquiring better bodies. Even Brahmā, the creator, who has the longest duration of life (his day being two thousand caturyugas) cannot be free from finitude. Then what to talk of all other things and beings which appear during the day of Brahmā and disappear during his night? Hence all the lokas and achievements therein are finite. God is the only eternal and changeless principle who is beyond the unmanifest and manifest creation. He is imperishable and is the supreme goal of life. All beings exist in Him and everything is pervaded by Him. Attaining Him, one does not take rebirth in the mortal world (saṃsāra) (15 to 22).\n\nThus the Lord established that attainment of God is the highest goal compared to all other achievements. Now Krishna discusses the two paths that lead to the two goals which are subject to non-return and return. An upāsaka attains krama-mukti by departing through the bright-path (śukla-gati) which is presided over by the deities of fire, day, bright-fortnight and uttarāyaṇam. (He goes to Brahmaloka, gains Self-knowledge from Brahmā and becomes liberated.) Ritualists go by the dark-path (Krishna-gati) which is presided over by the deities of smoke, night, dark-fortnight and dakṣiṇāyanam. They come back after enjoying in the heavens (23 to 26).\n\nSince the bright path takes one to God, one should choose that alone. To take to that path one should become an upāsaka. Hence Krishna advises Arjuna to be committed to upāsanā (27).\n\nConcluding the topic, Krishna glorifies the result of upāsanā as superior to all other results gained through all other pursuits. Because, none of them can take one to that goal which the Upasaka attains — the supreme, primal God.\n\n(Upāsanā can take a seeker to Guru and śāstra. Naturally upāsaka becomes jñāni-bhakta. He is liberated in this very life. He has no travel. This aspect (jīvanmukti) was talked in the seventh chapter and will be continued from the ninth chapter.\n\nIf upāsanā does not take one to guru and śāstra, he continues to be self-ignorant. He is not liberated in this life. But he travels by the bright-path to Brahmaloka. Instructed by Brahmā, the creator himself, he becomes jñāni-bhakta and is liberated. This is called krama-mukti, which is discussed in the eighth chapter.\n\nThus upāsanā is useful for jīvanmukti as well as krama-mukti.)\n\n\n\n1. Definition of the terms Brahman, adhyātma, karma, adhibūta, adhidaiva and adhiyajña : 1 to 4\n2. The significance and the method of remembering the Lord at the time of death: 5 to 14\n3. Comparison between two types of goals — God and world: 15 to 22\n4. The bright and dark paths: 23 to 27\n5. Glory of upāsanā: 28\n\nSince Krishna begins the teaching with Akṣara-brahman this chapter is called Akṣara-brahma-yoga.\n\n"}, {"chapter_number": 9, "text": "Rājavidyā-rājaguhya-yoga – The Royal Secret\n\nThe previous chapter was a brief digression into techniques of saguna-upasana which is not the main theme of the Gita. Here the Lord continues the teaching as it was given in the 7th chapter and reiterates and expounds on those matters. He again points out that those who seek mere materialistic results can gain those by His grace but anyone who desires Him alone will merge with Him, regardless of their worldly conditionings based on gender, birth etc. Below are the main themes of Chapter 9:\n\nVerses 1 – 3\nIntroduction to the knowledge, its glory and necessary qualifica-tions\n\nVerses 4 – 10\nNature of God\n\nVerses 11\nCause of bondage\n\nVerses 12 – 19\nAtheists, theists and types of upāsanā\n\nVerses 20 – 29\nSakāma-bhaktas and niṣkāma-bhaktas\n\nVerses 30 – 34\nGlory of bhakti\n\n\n<h5>Background</h5>\nIn the previous three chapters, Lord Krishna revealed God as the ma-terial cause of the universe. Since the effect cannot be different from the material cause, it clearly follows that the universe cannot be different from God. Thus the entire universe is the divine manifestation of God. Hence whatever glories we see in the creation belong to the Lord alone. Krishna reveals this idea in this chapter as the culmination of his teaching of Virāṭ (Viśvarūpam).\n\nIn the first three verses, Krishna introduces the topic of vibhūti and yoga — vibhūti is the manifestation of Lord and yoga is the power of manifestation. Even great sages cannot talk about the glories of the Lord, because they are finite beings born later. Hence it is the rarest knowledge that is given. One who gains this knowledge will be free from saṃsāra (1 to 3).\n\nIn the next four verses, the Lord reveals His glory by pointing out that the entire subtle universe of thoughts as well as the gross universe are born of Him. The seven great sages, the four sages Sanaka etc., and the Manus are all born of the mind of the Lord. One who knows this attains self-knowledge ultimately (4 to 7).\n\nThe following four verses deal with the Virāṭ-devotees and the benefits of such a devotion. The devotees accept everything as a gift of God, because God is the source of all. They think about God, speak about God, hear about God — in short they spend their lives revelling in God all the time (8, 9). (Still they are saguṇa-devotees only. They are ignorant of the highest nature of the Lord.) The Lord says that He takes the responsibility of enlightening them. Out of compassion for them, the Lord lights up the lamp of knowledge, remaining in their heart. (The idea is that the Lord will provide them with a guru and the necessary conditions for the knowledge of the highest nature of God.) (10, 11)\n\nIn the next seven verses (12 to 18), Arjuna requests Krishna to give the details of His glories (manifestations) which will help him in upāsanā. (Each expression of God in the universe can become a symbol for upāsanā. Later, when see every glory as the expression of God, it becomes the appreciation of Virāṭ. This helps in the expansion of the mind.]\n\nFrom verse 19th to the end of the chapter, Bhagavān describes His glories. The Lord is careful to add both in the beginning and in the end that it is not an exhaustive list of His glories. They are the important ones. Nobody can exhaust the glories of the Lord (19, 40). Krishna begins the enumeration with the very Self. The best, the closest and the most evident expression of the Lord is the very ‘I’, the consciousness (20). Krishna concludes the list by pointing out that He is the very existence in all beings, because He is the material cause (bījam) of all (39). In short, whatever there is which is glorious, rich or powerful — all of them are the expressions of only a ray of God’s glory (41). In fact it is not that the Lord’s glory is in the world, but the entire world is in the Lord, occupying a part of Him, as it were (42). (The world cannot be a part of the Lord in the real sense of the term, because it is only apparent as the Lord Himself negates it in IX-5.)\n\n\n\nIntroduction and the glory of this knowledge: 1 to 3\nLord’s glory in brief and the benefit of that knowledge: 4 to 7\nVirāṭ-devotees and the benefit of such a devotion: 8 to 11\nArjuna’s request for elaboration: 12 to 18\nLord’s glories elaborated: 19 to 42\n\nSince the main theme of this chapter is the Lord’s glories, this chapter is called Vibhūti yoga.\n\n"}, {"chapter_number": 10, "text": "Vibhūti-Yoga – The Divine Glories\n\nArjuna acknowledges the Supreme nature of the Lord but asks how He can constantly be remembered even as one is perceiving this pluralistic world. In response, the Lord provides a long list of His glorious manifestations in the perceived universe. Lest anyone misunderstand that the Lord is limited to these forms, he concludes by saying that there is, in fact, no end to His glories. Below are the main themes of Chapter 10:\n\nVerses 1 – 3\nIntroduction and the glory of this knowledge\n\nVerses 4 – 7\nLord’s glory in brief and the benefit of that knowledge\n\nVerses 8 – 11\nVirāṭ-devotees and the benefit of such a devotion\n\nVerses 12 – 18\nArjuna’s request for elaboration\n\nVerses 19 – 42\nLord’s glories elaborated\n\n\n<h5>Background</h5>\nIn the previous three chapters, Lord Krishna revealed God as the ma-terial cause of the universe. Since the effect cannot be different from the material cause, it clearly follows that the universe cannot be different from God. Thus the entire universe is the divine manifestation of God. Hence whatever glories we see in the creation belong to the Lord alone. Krishna reveals this idea in this chapter as the culmination of his teaching of Virāṭ (Viśvarūpam).\n\nIn the first three verses, Krishna introduces the topic of vibhūti and yoga — vibhūti is the manifestation of Lord and yoga is the power of manifestation. Even great sages cannot talk about the glories of the Lord, because they are finite beings born later. Hence it is the rarest knowledge that is given. One who gains this knowledge will be free from saṃsāra (1 to 3).\n\nIn the next four verses, the Lord reveals His glory by pointing out that the entire subtle universe of thoughts as well as the gross universe are born of Him. The seven great sages, the four sages Sanaka etc., and the Manus are all born of the mind of the Lord. One who knows this attains self-knowledge ultimately (4 to 7).\n\nThe following four verses deal with the Virāṭ-devotees and the benefits of such a devotion. The devotees accept everything as a gift of God, because God is the source of all. They think about God, speak about God, hear about God — in short they spend their lives revelling in God all the time (8, 9). (Still they are saguṇa-devotees only. They are ignorant of the highest nature of the Lord.) The Lord says that He takes the responsibility of enlightening them. Out of compassion for them, the Lord lights up the lamp of knowledge, remaining in their heart. (The idea is that the Lord will provide them with a guru and the necessary conditions for the knowledge of the highest nature of God.) (10, 11)\n\nIn the next seven verses (12 to 18), Arjuna requests Krishna to give the details of His glories (manifestations) which will help him in upāsanā. (Each expression of God in the universe can become a symbol for upāsanā. Later, when see every glory as the expression of God, it becomes the appreciation of Virāṭ. This helps in the expansion of the mind.]\n\nFrom verse 19th to the end of the chapter, Bhagavān describes His glories. The Lord is careful to add both in the beginning and in the end that it is not an exhaustive list of His glories. They are the important ones. Nobody can exhaust the glories of the Lord (19, 40). Krishna begins the enumeration with the very Self. The best, the closest and the most evident expression of the Lord is the very ‘I’, the consciousness (20). Krishna concludes the list by pointing out that He is the very existence in all beings, because He is the material cause (bījam) of all (39). In short, whatever there is which is glorious, rich or powerful — all of them are the expressions of only a ray of God’s glory (41). In fact it is not that the Lord’s glory is in the world, but the entire world is in the Lord, occupying a part of Him, as it were (42). (The world cannot be a part of the Lord in the real sense of the term, because it is only apparent as the Lord Himself negates it in IX-5.)\n\n\n\nIntroduction and the glory of this knowledge: 1 to 3\nLord’s glory in brief and the benefit of that knowledge: 4 to 7\nVirāṭ-devotees and the benefit of such a devotion: 8 to 11\nArjuna’s request for elaboration: 12 to 18\nLord’s glories elaborated: 19 to 42\n\nSince the main theme of this chapter is the Lord’s glories, this chapter is called Vibhūti yoga.\n\n"}, {"chapter_number": 11, "text": "Viśva-Rūpa-Darśana-Yoga – The Cosmic Form\n\nIn this chapter, Lord Krishna gifts Arjuna the divine vision which enables him to perceive the Lord in His Cosmic form – a form that even the Gods long to see but are unable to. The bulk of the chapter comprises of Arjuna describing the various sights he beholds within the Lord’s form. Whereas the previous chapter showcased the manifestations of the One Supreme Self in the many, this chapter completes the narrative by driving home the point that those many forms are, in fact, sustained in and part of that One Self, which alone is the reality. Below are the main themes of Chapter 11:\n\nVerses 1 – 4\nArjuna desires to see the universal form\n\nVerses 5 – 8\nKṛṣṇa grants the divine eye\n\nVerses 9 – 14\nSañjaya’s description of the universal form\n\nVerses 15 – 22\nArjuna’s description of the universal form(first phase expressing wonder)\n\nVerses 23 – 30\nArjuna’s description of the universal form (second phase expressing fear)\n\nVerses 31 – 34\nKṛṣṇa answers Arjuna’s question\n\nVerses 35 – 45\nArjuna’s description of the universal form(third phase expressing devotion)\n\nVerses 46 – 55\nWithdrawal of the universal form and glorification of devotion\n\n\n<h5>Background</h5>\nIn the previous four chapters, Krishna established that the entire universe is a manifestation of God and, therefore, any glory in the creation belongs to God alone. Now, in this chapter, Arjuna appreciates this teaching and sees the universe as the very Lord.\n\nIn the first two verses, Arjuna summarizes the entire teaching of Krishna – the nature of jīva (predominantly discussed in the first six chapters) and the nature of God (predominantly discussed in the later four chapters). Though Arjuna has received the teaching, he is unable to appreciate the universal form due to some mental blocks. Hence, he prays to the Lord for the vision of the universal form of the Lord (3, 4).\n\nLord Krishna agrees to bless Arjuna with the vision of the universal form (5 to 7). Since this is not possible to have such a vision with the ordinary eyes, Krishna grants Arjuna the divine eye for this special purpose (8). (Universal form is not a special form of the Lord. It is the Lord as the universe. As such, it is available for all at all times. The Lord need not show it. Still we miss it because of our narrow outlook of the world. Once we refine our mind and look at the universe, we cannot miss the Lord. His stamp is there in all, from a blade of grass to the farthest star. Such a mind which is tuned to see the Lord is the divine eye behind the fleshy eyes. It is such an eye that Krishna granted to Arjuna.)\n\nFrom the 9th to the 14th verse, we get a description of the universal form from Sañjaya. He picturises the Lord as a person with all divine ornaments shining with the brilliance of a thousand suns risen together. (We should remember that this is a description of the world only, divinised by the change of outlook. Every exalted object in the creation should be taken as an ornament of the Lord.)\n\nFrom the 15th verse, we get Arjuna’s appreciation of the universal form. (Arjuna goes through the various phases as he sees the universal form. The first response is one of wonder only.) Arjuna sees all beings in the cosmic body of the Lord. The sun and the moon are like his eyes. He sees the hands, legs, etc., of the people as those of the Lord. Now, the Lord’s body with thousands of hands, legs, etc., appears without beginning, middle or end (15 to 22).\n\nNow Arjuna’s attention is turned towards the mouth of the Lord which represents Time (Death). With blazing fire and protruding teeth, the Lord’s mouth evokes terror in all, including Arjuna. Arjuna sees the entire world being scorched by this fire (Time), while many are rushing towards the mouth of the Lord. Some are already inside the mouth and some are crushed between the teeth. All these cause great fear and confusion in Arjuna and he begins to doubt whether the Lord is a loving father or a terrible destroyer (23 to 31). (This shows that Arjuna is still not able to see the Lord as a whole. He is able to accept ‘birth’ as part of the universe, but not ‘death’. This partial outlook is the cause of fear and confusion. This is the second phase.)\n\nThen, the Lord clarifies that the fierce aspect also is Himself, manifesting as the Time-principle. When the time comes for people to die, the Lord finds the instruments to bring this about and Arjuna happens to be one of them in the hands of the Lord (32 to 34). Having understood the Lord to be ‘the cosmic stage manager’, Arjuna surrenders to His Will and sings His glory (34-45). (Now Arjuna appreciates the Lord as totality, the basis of creation-preservation-dissolution. In front of the Lord everything else is insignificant. This appreciation makes him a devotee, seeking forgiveness for all his past omissions and commissions. Thus, the third phases is true devotion to the Lord, born out of right understanding).\n\nArjuna is indeed happy to have this unique vision of the Lord. Still, one part of his mind is not able to accept the totality, especially the destructive aspect. So Arjuna requests the Lord to withdraw his form (46).\n\nIn the last nine verses (47 to 55), we see the Lord withdrawing His universal form (i.e., the Lord takes away the divine eye that Arjuna enjoyed till now. Arjuna comes down to look at the world in his own private way.) The Lord praises devotion as a means to this cosmic vision. This universal form could be seen by Arjuna because of his devotion. Through devotion one can purify the mind, see the universal form, know the true nature of the Lord, and become one with the Lord.\n\nHence, Krishna tells Arjuna – “Do actions for My sake; be My devotee; keep Me as the ultimate goal; be detached (from the world); be free from hatred towards all. Such a person reaches Me.”\n\n\n\nArjuna desires to see the universal form: 1 to 4\nKrishna grants the divine eye: 5 to 8\nSañjaya’s description of the universal form: 9 to 14\nArjuna’s description of the universal form(first phase expressing wonder): 15 to 22\nArjuna’s description of the universal form (second phase expressing fear): 23 to 30\nKrishna answers Arjuna’s question: 31 to 34\nArjuna’s description of the universal form(third phase expressing devotion): 35 to 45\nWithdrawal of the universal form and glorification of devotion: 46 to 55\n\nSince this chapter deals with the universal form of the Lord, it is called Viśvarūpadarśana yoga.\n\n"}, {"chapter_number": 12, "text": "Bhakti-yoga – The Yoga of Devotion\n\nThe shortest chapter of the Gita but in some ways one of the most important ones because it clearly explains the meaning of a term that is often misunderstood – Bhakti. The Lord succinctly points out the attributes that denote a true Bhakta who is dear to Him, thereby providing us with a list of qualities we must strive to cultivate in ourselves. Below are the main themes of Chapter 12:\n\nVerses 1 – 2\nArjuna’s question and Kṛṣṇa’s answer\n\nVerses 3 – 12\nThe five stages of bhakti (prasādabuddhi, īśvarārpaṇabuddhi, iṣṭadevatā-upāsanā, virāḍ-upāsanā and akṣara-upāsanā jñā-nayoga)\n\nVerses 13 – 19\nTraits of parābhakta (parābaktalakṣaṇa)\n\nVerses 20\nGlory of the teaching\n\nVerses 35 – 47\nArjuna’s delusion which stems from his ignorance about the true nature of oneself (moha)\n\n\n<h5>Background</h5>\nThe eleventh chapter has paved the way for virāḍ-bhakti. So, in the twelfth chapter, the Lord deals with all aspects of bhakti leading to liberation.\n\nThe chapter begins with Arjuna’s question seeking to know whether virāḍ-bhakta (saguṇabhakta) or akṣara-bhakta (nirguṇa-bhakta) is superior (1).\n\nLord Krishna first answers that saguṇabhakta is superior. (In fact, we cannot compare them. Everyone has to go through both and one can reach the Lord through nirguṇabhakti alone, which the Lord himself points out in the 4th verse. Still the Lord praises saguṇabhakta because of the context.) (2)\n\nFrom the 3rd verse to the 12th verse, Krishna gives out the entire range of bhakti which leads to liberation. In the first 3 verses (3 to 5) Krishna talks about nirguṇabhakti which is jñānayoga and which is the direct means for liberation. But, the Lord points out that this would be difficult for unprepared people (5).\n\nFrom the 6th verse to the 8th verse, the Lord speaks about the next lower stage in the form of virāḍ-upāsanā. He promises that such upāsaka would be rescued from saṃsāra by the Lord. (This does not mean that a virāḍ-upāsaka can get liberation, skipping jñānayoga. The idea is that he becomes fit for jñānayoga and attains liberation through knowledge.)\n\nIn the 9th verse, the Lord comes one more step down. If one is incapable of doing virāḍ-upāsana, let him practice meditation on any form of the Lord (iṣṭadevatā-upāsanā). Thus, upāsanā (on virāḍ or iṣṭadevatā) becomes the preparatory step for jñānayoga.\n\nIn the next verse (10th), the Lord comes down further. If a person is too extrovert to take up upāsanā, he is asked here to perform his duty (nitya and naimittika) as an offering to the Lord (Īśvarārpaṇam) without expecting any reward.\n\nWhen a person is full of desires, he is impelled to do desire-born actions (kāmya) expecting results. For such a person Krishna prescribes the last step. When he receives the result of kāmya-karmas, let him take it as a prasāda (graceful gift) of the Lord and avoid reaction. Krishna indicates this through the word ‘sarvakarmaphalatyāgam’ (11).\n\nThe above two steps come under karmayoga. (A karmayogī becomes fit for upāsanā after some time. Upāsanā makes him qualified for jñānayoga. Jñāna helps him discover his own true ever-free nature.)\n\nKrishna concludes this topic by praising the last step of karma-yoga (12).\n\nFrom the 13th verse up to the 19th verse, Krishna gives a clear picture of the characteristics of one who has gone through all these steps and discovered fulfillment. [As a karmayogī and upāsaka he was a devotee of saguṇa-īśvara, seeing the Lord as distinct from him. This is only lower bhakti, because he does not know the true nature of the Lord still (Refer VII-17). His bhakti is saguṇabhakti or bhedabhakti or aparā-bhakti. Once he pursues jñānayoga and discovers his identity with the Lord, his bhakti becomes nirguṇabhakti or abhedabhakti or parā-bhakti, which is an end in itself.] In these verses Krishna describes the traits of a parabhakta who is a sthitaprajña (Refer II-55 to 72). (This serves twofold purpose. Firstly, it is an inspiration for a seeker to pursue his sādhanam. Secondly, the natural traits of a parabhakta serve as values for a sādhaka to be deliberately practised.)\n\nThis portion can be broadly divided into two. One referring to those virtues which a parabhakta spontaneously enjoys, and the second, referring to those negative traits which he is totally free from.\n\nKrishna concludes the teaching by saying — “Those who follow this teaching with faith, keeping Me as the goal, are very dear to Me.” (20)\n\n\n\nArjuna’s question and Krishna’s answer: 1, 2\nThe five stages of bhakti (prasādabuddhi, īśvarārpaṇabuddhi, iṣṭadevatā-upāsanā, virāḍ-upāsanā and akṣara-upāsanā jñā-nayoga): 3 to 12\nTraits of parābhakta (parābaktalakṣaṇa): 13 to 19\nGlory of the teaching: 20\n\nSince this chapter talks about all stages of bhakti, this is called ‘Bhakti yoga’\n\n"}, {"chapter_number": 13, "text": "Prakṛti-Puruṣa-Viveka-Yoga – The Yoga of Distinguishing Matter from Spirit\n\nWhereas the first 6 chapters of the Gita were focused on the individual self (jiva) and the next 6 on the seemingly external Supreme Reality (Ishvara), the final 6 chapters beginning with this one show that they are actually one. The key to this oneness is the ability to disregard the transient and inert matter envelopments and understand the reality of the Self alone. To do that, one must know what constitutes matter and this chapter explains that using the concepts of “field” and “knower of the field”. Below are the main themes of Chapter 13:\n\nVerses 1\nIntroduction\n\nVerses 2 – 7\nKṣetram and kṣetrajña\n\nVerses 8 – 12\nJñānam\n\nVerses 13 – 19\nJñeyam\n\nVerses 20 – 24\nPuruṣa and prakṛti\n\nVerses 25 – 35\nSādhanam and phalam\n\n\n<h5>Background</h5>\nIn the first six chapters, Lord Krishna talked about the nature of jīva (tvam-pada) and karmayoga predominantly. In the second six chapters, Bhagavān discussed the nature of Īśvara (tat-pada) and upāsanā predominantly — especially virāḍ-upāsanā. When a seeker goes through these stages of understanding and sādhanam, he becomes ready for jñānayoga which is the recognition of the identity between the jīva and Īśvara (asi-pada). This is the topic which will be dealt with in the following six chapters.\n\nThe thirteenth chapter is presented in the form of six topics — kṣetram, kṣetrajña, jñānam, jñeyam, puruṣa and prakṛti.\n\nThough these are discussed separately, we should note that kṣetrajña, jñeyam, and puruṣa are the same essentially. Similarly, kṣetram and prakṛti are essentially the same.\n\nKṣetram\n\nThe entire objective universe is kṣetram. From the beginningless prakṛti (avyaktam) everything experienced by us comes under this. It includes mahat (cosmic intellect), ahaṅkāra (cosmic ego), the subtle and gross elements, sense organs of action and perception, the mind and its modifications (6, 7). Still, Krishna specially mentions the body as kṣetram (2) because we generally do not see the body as part of the universe.\n\nKṣetrajña\n\nThat conscious principle which illumines the kṣetram is called kṣetrajña (2). Having defined kṣetrajña, Krishna reveals that the kṣetrajña is none other than the Lord (i.e. Brahman) Himself who is the consciousness in all bodies (3). Thus, kṣetrajña is one all-pervading consciousness. (This kṣetrajña alone is called jīva. So, the idea given here is the essential identity of jīva and Īśvara.)\n\nJñānam\n\nFrom the 8th to the 12th verse, Krishna talks about some important val-ues which prepare the mind for Self-knowledge. They are: humility, simplicity, non-violence, forbearance, honesty, service to the teacher, purity, steadfastness, self-control, detachment from sense objects, absence of egoism, constant awareness of the misery in birth, death, etc., dispassion, non-identification with son, wife, house, etc., being always equanimous in desirable and undesirable situations, unswerving devotion to the Lord, seclusion, non-indulgence in people’s company, constant self-enquiry, and not losing sight of the fruit of Self-knowledge.\n\nJñeyam\n\nIn the next six verses (13th to 18th), Krishna talks about the Truth which is to be known. It is beginningless, beyond sat and asat (13), all-pervading, subtle, far (for the ignorant), and near (for the wise) (16). Though undivided, it appears divided and it is the creator, sustainer, and destroyer of all (17). It is the light of consciousness which resides in the heart of all (18). Being subtle, it cannot be known in its pure form. Yet, it shines in the body (as Awareness-Existence) and in the world (as Existence). One has to recognize it as pure Awareness-Existence by distinguishing it from the body and the world (14, 15). (This method of teaching is called adhyāropa-apavāda-prakriyā i.e. the method of superimposition and negation.)\n\nHaving talked about these four topics, Krishna glorifies this knowledge as the one which leads the seeker to Him (19).\n\nPuruṣa and Prakṛti\n\nNow comes the last pair, puruṣa and prakṛti (20 to 24). Both are beginningless. Blessed by puruṣa, prakṛti creates everything (20 and 27). (Though beginningless, puruṣa and prakṛti are of opposite nature. While puruṣa is conscious, changeless and real, prakṛti is inert, changing, and unreal.) The body, the mind, and their activities belong to prakṛti, whereas puruṣa is a mere illuminator of all these (21). When puruṣa obtains in the body as kṣetrajña, it seems to be a kartā, bhoktā, etc. But as paramātmā, the absolute, it is ever unaffected and is ever the same (23). Not knowing this, when puruṣa (i.e. kṣetrajña) identifies with the body and its guṇas, then, all limitations and the consequent problems arise (22). One who has the discriminative knowledge of puruṣa and prakṛti attains immortality (24).\n\nIn the following verses (25th and 35th) Krishna sums up the teaching and presents its sādhanam and phalam. The wise man is one who always abides in the Self, which is the same everywhere (28 and 29), which is actionless (30), and which is unaffected (32) like the space or like the light (34). The Self is not only the illuminator of everything (34) but also the substratum of the whole universe (31). In fact, there is no universe other than the Self (35). One who has assimilated this wisdom is Brahman itself (31) and attains the supreme goal of liberation (35).\n\nTo gain this knowledge, one has to purify the mind through karma-yoga, gain knowledge through enquiry (sāṅkhya-yoga), and ultimately get established in the knowledge through dhyānayoga (25 and 26).\n\n\n\nIntroduction: 1\nKṣetram and kṣetrajña: 2 to 7\nJñānam: 8 to 12\nJñeyam: 13 to 19\nPuruṣa and prakṛti: 20 to 24\nSādhanam and phalam: 25 to 35\n\nSince the main topic is the discrimination between the kṣetram and kṣetrajña, this chapter is called Kṣetrakṣetrajña vibhāga yoga.\n\n"}, {"chapter_number": 14, "text": "Guṇa-Traya-Vibhāga-Yoga – The Yoga of the Threefold Modalities\n\nVerses 1 – 4\nIntroduction\n\nVerses 5 – 18\nAnalysis of guṇas\n\nVerses 19 – 20\nKnowledge as the means to transcend the guṇas\n\nVerses 21 – 27\nGuṇatīta-lakṣaṇam and sādhanam\n\n\n<h5>Background</h5>\nIn the 13th chapter, Lord Krishna said that it is the association with the guṇas of prakṛti that is responsible for rebirth i.e. saṃsāra (XIII-22). In this chapter, the Lord deals with this topic elaborately and shows how one can be free from these binding guṇas.\n\nIn the first two verses Krishna praises Self-knowledge to draw Arjuna’s attention. It is the greatest knowledge which takes one to the greatest goal of liberation. By this knowledge, one attains the nature of God Himself and thus becomes free from birth and death.\n\nIn the next two verses, Krishna gives a brief account of creation. Blessed by the Lord (puruṣa), prakṛti gives birth to this universe. Thus, they are the universal parents from whom all things and beings originate.\n\nFrom the 5th to the 18th verse, Bhagavān makes an elaborate analysis of the three guṇas — sattva, rajas and tamas. They are born of prakṛti and are responsible for the human bondage. The Lord analyses them from various angles which can be depicted in the form of a chart.\n\nEven though all the beings have the three guṇas, they differ because of the predominance of one guṇa over the other two. (It is also possible to change the proportions for which alone all the preparatory sādhanās are prescribed) (10).\n\nIn the 19th and 20th verses, Krishna teaches the means of transcending the guṇas. The Lord points out that the transcendence is in the form of knowledge alone. The Self (puruṣa) happens to be already beyond the guṇas (guṇātīta). It is the body (prakṛti) which has guṇas, doership, etc. Because of identification with the body alone, the Self (puruṣa) seems to have guṇas. Hence the only solution is to discriminate and own up the guṇātīta puruṣa as oneself (19). Through this knowledge, one discovers oneself to be free from birth, death, etc. This is liberation (20).\n\nArjuna asks Krishna about the characteristics of a guṇātīta and the sādhanā to achieve this (21).\n\nFrom the 22nd to the 25th verse, Krishna answers the first question. Guṇatīta is one who is detached from prakṛti. He does not have I-notion in his body or my-notion in the world. Hence, he looks at the variations of guṇas objectively without reacting to them (22). He remains unaffected by the opposite experiences of life like pleasure-pain, praise-censure, honour-dishonour, etc. They are the play of prakṛti (23, 24). Being full, he does not seek anything and therefore is free from selfish activities (25). (Since a guṇātīta is invariably a wise man, this description tallies with the sthitaprajña portion of the 2nd chapter as well as the parābhakta portion of the 12th chapter).\n\nKrishna concludes by prescribing bhakti as the sādhanā to achieve this goal. (Thus, the Lord answers Arjuna’s second question. By the grace of the Lord one gets a guru. Through the guru, one gets the knowledge which makes one guṇātīta). A bhakta becomes fit to attain Brahman’s nature (guṇātītatvam) which is immortality and absolute ānanda (26, 27).\n\nTo gain this knowledge, one has to purify the mind through karma-yoga, gain knowledge through enquiry (sāṅkhya-yoga), and ultimately get established in the knowledge through dhyānayoga (25 and 26).\n\n\n\nIntroduction: 1 to 4\nAnalysis of guṇas: 5 to 18\nKnowledge as the means to transcend the guṇas: 19 to 20\nGuṇatīta-lakṣaṇam and sādhanam: 21 to 27\n\nSince the main topic here is the discrimination of the three guṇas and the Self (puruṣa), this chapter is called Guṇatraya vibhāga yoga.\n\n"}, {"chapter_number": 15, "text": "Puruṣottama-Yoga – The Yoga of the Ultimate Person\n\nVerses 1 – 3\nDescription of saṃsāra\n\nVerses 3 – 6\nMeans of liberation\n\nVerses 7 – 11\nBrahman as jīva\n\nVerses 12 – 15\nBrahman as jagat\n\nVerses 16 – 18\nBrahman as puruṣottama\n\nVerses 19 – 20\nGlory of puruṣottama-jñānam\n\n\n<h5>Background</h5>\nIn the 13th and 14th chapters, the Lord dealt with the main theme of the Gītā — the essential oneness of jīva and Īśvara. Being a subtle topic, Krishna discusses the same in this chapter also, in a different way.\n\nIn the first two and a half verses, Krishna gives a description of the vast and endless saṃsāra by comparing it with the mighty aśvattha-tree. Like this tree, this saṃsāra is vast, many-branched, well-rooted and not easily destructible. To add to this is its mysterious nature. (The jīva is caught in this saṃsāra, helplessly struggling to free itself.)\n\nIn the next two and half verses (upto the 5th), Bhagavān talks about the means to get out of this saṃsāra. The first step is to develop detachment from this saṃsāra by recognizing its binding nature. (As long as one has value for worldly pursuits, one’s mind will not be available for seeking freedom.) Having withdrawn the mind from worldly desires, one should seek Brahman, the cause of everything (4). (Seeking Brahman is nothing but jñānayoga — vedantic enquiry under a guru.) Then, Krishna highlights the qualifications necessary for this knowledge. Freedom from (reaction towards) the pairs of opposites, pride, delusion, and attachment as well as a commitment to vedantic enquiry are emphasized here (5).\n\nIn the 6th verse, the Lord talks about the nature of Brahman. It is not illumined by anything (because it is the self-effulgent consciousness which illumines everything). Attaining this Brahman, the supreme abode of the Lord, one does not return to saṃsāra again.\n\n[In the following sections, Krishna reveals that Brahman alone expresses in the form of jīva and jagat (universe). From this it becomes clear that reaching Brahman does not involve travel.]\n\nFrom the 7th to the 11th verse, Krishna shows that the jīva, the consciousness in every being, is the Lord’s (Brahman’s) expression only (7). At the time of death, this jīva alone takes the mind and sense organs from one body to another body. (8). It is this jīva who experiences everything through the sense organs (9). Thus, the Lord alone is expressing in the form of the very life and its functions in every being (10). The pure minded ones recognize this whereas the deluded ones do not (11).\n\nFrom the 12th to the 15th verse, Krishna shows how the jagat (the universe) also is an expression of the Lord (Brahman). The light in the sun, the moon, and the fire is the Lord only (12). In the form of the sunlight and moonlight, the Lord alone sustains all living beings (13). As the digestive fire, it is the Lord who digests the food (14). The Lord alone is behind all the mental faculties of knowledge, memory, etc. He is the author and the content of the Vedas as well as the knower of the Vedas (15).\n\n(Thus, Krishna reveals that Brahman alone is in the form of jīva and jagat. Hence reaching Brahman is in the form of understanding only — understanding that Brahman is never away from either oneself or the universe.)\n\nIn the next three verses, Bhagavān reveals Brahman in its true nature. Brahman, in the form of the manifest universe, is called kṣarapu-ruṣa. As the unmanifest universe (māyā), the same Brahman is called akṣarapuruṣa (16). Both these puruṣas are relative. Beyond these two puruṣas is the uttamapuruṣa, the absolute. Because of its superiority, it is called paramātmā or puruṣottama. It is the imperishable (attributeless) Brahman because of which everything exists (17, 18).\n\nConcluding the teaching, Krishna glorifies this knowledge as the means of fulfillment. With an undeluded mind, the one who knows this most secret knowledge of puruṣottama, becomes the knower of all and a person of fulfillment (19, 20).\n\n\n\nDescription of saṃsāra: 1 to 3\nMeans of liberation: 3 to 6\nBrahman as jīva: 7 to 11\nBrahman as jagat: 12 to 15\nBrahman as puruṣottama: 16 to 18\nGlory of puruṣottama-jñānam: 19, 20\n\nSince the main topic of this chapter is puruṣottama, this chapter is called Puruṣottama yoga.\n\n"}, {"chapter_number": 16, "text": "Daivāsura-Sampad-Vibhāga-Yoga – The Yoga of Differentiating Godly and Ungodly Assets\nWhat are the qualities one must cultivate in order to advance spiritually towards liberation and on the other hand, what are the qualities that will drag us down? Explaining those qualities, this chapter classifies beings into the divinely good (“deva”) and diabolically fallen (“asura”) and describes the behavior of the latter at length. This is so that we may introspect and understand where we stand and correct the course as necessary. Below are the main themes of Chapter 16:\n\nVerses 1 – 3\nDaivī-sampat\n\nVerses 4 – 21\nĀsurī-sampat\n\nVerses 22 – 24\nArjuna’s grief on seeing the enormity of the task he is about to undertake (śoka)\n\n\n<h5>Background</h5>\nIn the previous three chapters (XIII, XIV and XV) Bhagavān talked about Self-knowledge (jñānayoga) which is the direct means for liberation. In the following two chapters, Krishna discusses the values to be followed by a seeker. Though values themselves do not give liberation, they are necessary to gain knowledge. They alone prepare the mind and make it fit for receiving the knowledge. In fact, Vedānta is a pramāṇa (means of knowledge) only for a prepared mind.\n\nIn this chapter, Krishna divides all mental traits into two groups: daivī-sampat and āsurī-sampat. All sattvic traits come under the former, while rajasic and tamasic traits come under the latter. Daivī-sampat is conducive to Self-knowledge; āsurī-sampat is an obstacle to spiritual pursuit (5). [Without exception, every one in this universe falls under one of these two groups. From this it is evident that all seekers of knowledge must necessarily lead a spiritual (sattvic) life avoiding materialistic (rajasic and tamasic) tendencies.]\n\nKrishna enumerates daivī-sampat (1 to 3) and āsurī-sampat (4 to 21) which is listed below:\n\nDaivī-sampat\n\nFearlessness (1)\nPurity (1, 3)\nScriptural Study (1)\nCharity (1)\nSense-control (1)\nWorship of God (1)\nAusterity (1)\nStraightforwardness (1)\nNon-violence, kindness to all and absence of ill-will (2, 3)\nTruthfulness (2)\nRenunciation (2)\nCalmness and patience (2, 3)\nAbsence of slander (2)\nAbsence of greed (2)\nGentleness (2)\nModesty (2, 3)\nSteadfastness and absence of restlessness (2, 3)\nStrength (3)\n\nĀsurī-sampat\n\nVanity (4, 10, 14, 15, 17, 18)\nArrogance (4, 10, 14, 15, 17, 18)\nPretension (4, 10, 17)\nAnger (4, 12, 18)\nCruelty (4, 9)\nIgnorance (4, 15)\nImpurity (7)\nAbsence of religious discipline\nAbsence of truthfulness (7)\nAbsence of faith in God (8, 18)\nEndless desire for sense-pleasure (10, 11, 12, 16, 18)\nDelusion (10, 15, 16)\nFalse values (10, 16)\nWorry (11)\nAttachment (12)\nGreed (12, 13, 14)\nEgoism (18)\nSlander (18)\nĀsurī-sampat leads a person astray causing (spiritual) destruction ultimately (19, 20). Krishna sums up the entire āsurī-sampat as the three basic materialistic traits of desire, anger and greed. They are the three-fold gateway to hell (21). When one avoids these three traits and adopts the divine virtues, daivī-sampat, one becomes qualified for Self-knowledge and attains liberation soon (22).\n\nThe Lord concludes the chapter by pointing out that śāstra is the pramāṇa in determining what is right and wrong. One should know what the scriptures say and act accordingly (23, 24).\n\n\n\nDaivī-sampat: 1 to 3\nĀsurī-sampat: 4 to 21\nImportance of śāstra and conclusion: 22 to 24\n\nSince this chapter deals with daiva (spiritual) and āsura (materialistic) traits, it is called Daivāsura sampad vibhāga-yoga.\n\n"}, {"chapter_number": 17, "text": "Sraddhā-Traya-Vibhāga-Yoga – The Yoga of Differentiating Threefold Faith\n\nIn this chapter, the Lord shows how the concept of “guna” that was detailed in the 14th chapter applies to faith, worship, food, sacrifices/rituals, austerities and charity. The Lord explains that these common activities can each be categorized as sattvic, rajasic or tamasic depending on the manner in which they are conducted. Our goal is to engage in only the sattvic varieties since that alone is conducive to spiritual development. Below are the main themes of Chapter 17:\n\nVerses 1 – 6\nArjuna’s question and three types of śraddhā\n\nVerses 7\nKṛṣṇa introduces new topics\n\nVerses 8 – 10\nThree types of food\n\nVerses 11 – 13\nThree types of yajña\n\nVerses 14 – 16\nThree types of tapas (based on instrument)\n\nVerses 17 – 19\nThree types of tapas (based on guṇa)\n\nVerses 20 – 22\nThree types of charity\n\nVerses 23 – 28\nSignificance of “om tat sat” and conclusion\n\n\n<h5>Background</h5>\nIn the previous chapter, Bhagavān said that śāstra is the pramāṇa in determining what is right and wrong and that one should act according to what śāstra says. Based on this, Arjuna raises a question here — “To what category does a person belong if he worships with faith without scriptural knowledge – sattvic, rajasic, or tamasic?” (1)\n\nKrishna answers that he may belong to any category according to his temperament. An ignorant person’s faith will depend on his nature since he has no scriptural knowledge to guide. (By observing various types of worship done by others, he develops his faith according to his character. On the other hand, a person who goes by the scriptural teaching will invariably have sattvic faith) (2, 3).\n\nKrishna differentiates three types of faith based upon the object of worship (4). Even the nature of worship varies according to faith. People of tamasic faith take to severe practices involving torture of the body etc. (5, 6).\n\nHaving answered Arjuna’s question, Krishna discusses a few more topics namely food, yajña, tapas and charity, differentiating them into three types based on the guṇas (7 to 22). (Refer to the chart below.) [A seeker has to choose the sattvic type i.e. daivī-sampat and avoid rajasic and tamasic types i.e. āsurī-sampat.]\n\nBhagavān concludes the teaching mentioning the significance of the mantra “Om tat sat”. This originated from Brahmā’s mouth in the beginning of creation, and has been traditionally chanted during scriptural activities like yajña, tapas and dāna. The word ‘sat’ has many meanings like existence, goodness, good action, steadfastness and an action as an offering to the Lord (23 to 27). [In essence the utterance of this mantra will sanctify scriptural actions and make them sattvic.]\n\nIn the last verse, Krishna emphasizes the importance of śraddhā (faith). Without faith all scriptural activities become asat, i.e. fruitless (28).\n\n\n\nArjuna’s question and three types of śraddhā: 1 to 6\nKrishna introduces new topics: 7\nThree types of food: 8 to 10\nThree types of yajña: 11 to 13\nThree types of tapas (based on instrument): 14 to 16\nThree types of tapas (based on guṇa): 17 to 19\nThree types of charity: 20 to 22\nSignificance of “om tat sat” and conclusion: 23 to 28\n\nSince Śraddhā is highlighted both in the beginning and in the end, this chapter is called Śraddhātraya vibhāga yoga.\n\n\nKrishna divides tapas on the basis of the guṇās and also on the basis of the instrument as given below:\n\n\n\n"}, {"chapter_number": 18, "text": "Mokṣa-Yoga – The Yoga of Liberation\n\nThe concluding chapter of the Gita is essentially a summary of the entire Song of the Lord. In response to Arjuna’s opening question, the Lord differentiates mere abandonment from true renunciation and explains that renunciation of the false identification with matter and surrender to the Lord is guaranteed to lead us to Liberation. Below are the main themes of Chapter 18:\n\nVerses 1 – 12\nSannyāsa and tyāga\n\nVerses 13 – 17\nJñānayoga\n\nVerses 18 – 40\nThree types of knowledge, action, doer, intellect, will and hap-piness\n\nVerses 41 – 49\nKarmayoga (emphasizing svadharma)\n\nVerses 50 – 55\nJñānayoga (emphasizing meditation)\n\nVerses 56 – 62\nKarmayoga (emphasizing devotion)\n\nVerses 63 – 66\nFinal summary\n\nVerses 67 – 73\nLord’s concluding remarks\n\nVerses 74 – 78\nSañjaya’s concluding remarks\n\n\n<h5>Background</h5>\nLord Krishna dealt with Self-knowledge in the XIII, XIV and XV chapters. In the XVI and XVII chapters were discussed the values without which the mind will not be fit to receive the knowledge of the Self. With this, the Lord has exhaustively dealt with all the aspects of vedantic teaching.\n\nIn such a situation, Arjuna puts his last question to Krishna seeking to clarify the difference between sannyāsa and tyāga. Now begins the XVIII chapter answering Arjuna’s question. Bhagavān takes this opportunity to sum up His entire teaching which has been spread over the last sixteen chapters.\n\nThe chapter begins with Arjuna’s question — “Oh Lord! I desire to know the true nature of sannyāsa and tyāga distinctly” (1). Krishna replies by citing the views of some people (2, 3). The Lord gives his verdict from the 4th verse onwards. Bhagavān does not differentiate sannyāsa and tyāga. (This indicates that they are not different according to the Lord.) Krishna emphasizes the importance of obligatory rites (nityakarma) like yajña, dāna and tapas, and asserts that they should never be given up (5, 6) (We should note that this advice is given to people with impurity. Śāstras allow a person with purity to renounce nityakarma also). In the next three verses, the Lord divides renunciation into three types — tamasic, rajasic and sattvic. (For details see the chart)\n\nIn the following verses, Bhagavān glorifies sattvic renunciation. (In fact, sattvic renunciation is nothing but karmayoga.) A karmayogī renounces all the results of action. In due course he gets Self-knowledge. He is not affected by the consequences whether they are good, evil or a mixture of both (10 to 12).\n\nFrom the 13th to the 17th verse, Krishna gives a gist of jñānayoga. Five factors are involved in every action — the body, prāṇa, the mind with sense organs, the ego and the presiding divinity of all these. (In short, they are the four kośās and the presiding divinity) (13, 14). All actions, good or evil, are accomplished through these five factors only (15). The Self is not involved in any action. But, due to identification with the above factors, one mistakes oneself to be a doer (16). On the other hand, the wiseman, who does not have the false ‘I’ (ahaṅkāra) born of identification, is free from all karmas in spite of the activities of his equipments. He is neither a doer, nor an enjoyer (17).\n\nTaking a diversion, Bhagavān introduces six factors necessary for any vyavahāra (transaction). They are — knower, knowledge, known, doer, action and the instrument of action (18). Of these six factors, Krishna takes up three (knowledge, action and doer) for further division based on the three guṇas (19). Later, the Lord divides the intellect and will also on the same basis (29). Finally, Krishna talks about three types of happiness (36). (For details see the chart)\n\n\n\nKrishna \n\nKrishna concludes this topic by pointing out that there is nothing in the creation which is free from these three guṇas (40).\n\nWith an intention to sum up the entire Gītā-teaching, Bhagavān gives the essence of karmayoga (41 to 49) and jñānayoga (50 to 55) in the following section.\n\nHaving thus concluded the teaching, the Lord states the qualifications necessary to receive this. One who has no faith, discipline, devotion and desire to know should not be given this knowledge (67).The duties of the four varṇas (brāhmaṇas, kṣatriyas, vaiśyas and śūdras) are prescribed in the scriptures based on their nature (41 to 44). Karmayoga is the performance of one’s own duty as an offering to the Lord. This renders the mind fit for knowledge (45, 46). Here, Krishna makes it a point to emphasize the importance of svadharma (duty). It is necessary not only for the sake of purity but for the sake of social harmony also. Shriking one’s duty can only lead to total confusion (47, 48). The purified seeker, who is detached and self-controlled, will soon attain liberation through jñānayoga (40).\n\nNow the Lord introduces jñānayoga and gives a brief outline of meditation i.e. nididhyāsanam (which is necessary to assimilate the knowledge gained through śravaṇam and mananam). Having restrained all organs and having given up all disturbing thoughts like desire, anger etc., one should remain in a secluded place (51 to 53). Being firmly established in his Brahmannature, he becomes free from grief and desire. Being the same to all beings, he enjoys the highest devotion to the Lord (54). Having known the Lord in His true nature, he becomes one with Him (55). (Becoming one is nothing but dropping the notion of division.)\n\nIn the following verses (56 to 63), Krishna comes back to karmayoga, emphasizing the aspect of devotion i.e. the attitude of surrender. Constantly remembering the Lord, if one dedicates all his actions to Him, that devotee attains the Lord ultimately by effortlessly crossing over all obstacles (56 to 58). On the other hand, if one tries to evade his duty, which is based on his nature, it will be in vain and harmful (58 to 60). Hence, surrendering to the Lord of the heart, the controller of all, a devotee should strive to attain supreme peace by His grace (61 to 62). With this, Bhagavān concludes the teaching and directs Arjuna to do whatever he likes (63). But, the affection towards Arjuna overpowers Krishna once again (64). Hence, the Lord repeats His teaching emphatically once again — “Fix the mind on Me. (Be) My devotee. (Be) My worshiper. Surrender to Me. You shall reach Me alone. Truly do I promise to you. You are dear to Me. Having renounced all actions, seek Me, the nondual, (as your) shelter. I shall liberate you from all sins. Do not grieve” (65, 66). (These two verses are presenting karmayoga and jñānayoga in capsule form.)\n\nNow comes the phalam. One who imparts and the one who receives this wisdom attain the Lord Himself (68 to 70). Even the one who merely hears this with faith attains higher worlds (71).\n\nBeing satisfied with the teaching, Krishna asks Arjuna whether his delusion is gone. Arjuna gratefully acknowledges, promising to abide by the Lord’s teaching (72, 73).\n\nNow Sañjaya addresses Dhṛtarāṣṭra, exclaiming how blessed he was to listen to this glorious dialogue between the Lord and Arjuna (74, 75). Sañjaya remembers the whole dialogue and the cosmic vision with thrill (76, 77). He concludes his remarks with the declaration — “Where there is Krishna, the Lord of yoga, and where there is Arjuna, the wielder of the bow, there will be permanent wealth, victory, prosperity and justice” (78).\n\n\n\nSannyāsa and tyāga: 1 to 12\nJñānayoga: 13 to 17\nThree types of knowledge, action, doer, intellect, will and happiness: 18 to 40\nKarmayoga (emphasizing svadharma): 41 to 49\nJñānayoga (emphasizing meditation): 50 to 55\nKarmayoga (emphasizing devotion): 56 to 62\nFinal summary: 63 to 66\nLord’s concluding remarks: 67 to 73\nSañjaya’s concluding remarks: 74 to 78\n\nSince the chapter begins with Sannyāsa which is the means of liberation, it is called Mokṣa Sannyāsa yoga.\n\n"}]