[
  {
    "verse_sanskrit": "ॐ पार्थाय प्रतिबोधितां भगवता नारायणेन स्वयं व्यासेन ग्रथितां पुराणमुनिना मध्ये महाभारते अद्वैतामृतवर्षिणीं भगवतीमष्टादशाध्यायिनीं अम्ब त्वामनुसन्दधामि भगवद्गीते भवद्वेषिणीम्",
    "verse_trans": "oṃ pārthāya pratibodhitāṃ bhagavatā nārāyaṇena svayaṃ vyāsena grathitāṃ purāṇamuninā madhye mahābhārate advaitāmṛtavarṣiṇīṃ bhagavatīmaṣṭādaśādhyāyinīṃ amba tvāmanusandadhāmi bhagavadgīte bhavadveṣiṇīm",
    "verse_meaning": "That which was taught to Arjuna by Lord Narayana himself, Which was written by the epic sage Vyasa in the middle of Mahabaratha, Oh Mother goddess who showers the nectar of advaitha called the Bhagavad Gita, Which has eighteen chapters, I meditate on you mother who removes all past karma"
  },
  {
    "verse_sanskrit": "नमोऽस्तु ते व्यास विशालबुद्धे फुल्लारविन्दायातपत्रनेत्रे येन त्वया भारततैलपूर्णः प्रज्वलितो ज्ञानमयः प्रदीपः",
    "verse_trans": "namo’stu te vyāsa viśālabuddhe phullāravindāyātapatranetre yena tvayā bhāratatailapūrṇaḥ prajvalito jñānamayaḥ pradīpaḥ",
    "verse_meaning": "Salutations to Vyasa who has immense intellect, who has eyes like petals of a lotus flower, Who has filled up the oil to the lamp of Mahabaratha, and lighted it to pinpoint wisdom."
  },
  {
    "verse_sanskrit": "प्रपन्नपरिजाताय  तोत्रवेत्रैकपाणये  ज्ञानमुद्राय कृष्णाय  गीतामृतदुहे नमः",
    "verse_trans": "prapannaparijātāya  totravetraikapāṇaye  jñānamudrāya kṛṣṇāya  gītāmṛtaduhe namaḥ",
    "verse_meaning": "Salutations to Krishna who is a wish giving tree, who holds a cane to drive the cattle,  Who also shows the seal of Jnana, and gave us all the nectar of Gita."
  },
  {
    "verse_sanskrit": "सर्वोपनिषदो गावो  दोग्धा गोपालनन्दनः  पार्थो वत्सः सुधीर्भोक्ता  दुग्धं गीतामृतं महत्",
    "verse_trans": "sarvopaniṣado gāvo  dogdhā gopālanandanaḥ  pārtho vatsaḥ sudhīrbhoktā  dugdhaṃ gītāmṛtaṃ mahat",
    "verse_meaning": "All the Upanishads are the cows and Krishna is the one who milks them,  Arjuna is the calf, the devotees are the consumers of the great nectar of Gita."
  },
  {
    "verse_sanskrit": "वसुदेवसुतं देवं  कंसचाणूरमर्दनम्  देवकीपरमानन्दं  कृष्णं वन्दे जगद्गुरुम्",
    "verse_trans": "vasudevasutaṃ devaṃ  kaṃsacāṇūramardanam  devakīparamānandaṃ  kṛṣṇaṃ vande jagadgurum",
    "verse_meaning": "I salute the teacher of the world, who is the son of Vasudeva,  Who killed Kamsa and Chanoora and is the one who gave divine joy to Devaki."
  },
  {
    "verse_sanskrit": "भीष्मद्रोणतटा जयद्रथजला गान्धारीनीलोत्पला शल्यग्राहवती कृपेण वहिनी कर्णेन वेलाकुल अश्वत्तामविकर्णघोरमकरा दुर्योधनावर्तिनी सोत्तीर्णा खलु पाण्डवार्णवनदी कैवर्तकः केश्वः",
    "verse_trans": "bhīṣmadroṇataṭā jayadrathajalā gāndhārīnīlotpalā śalyagrāhavatī kṛpeṇa vahinī karṇena velākula aśvattāmavikarṇaghoramakarā duryodhanāvartinī sottīrṇā khalu pāṇḍavārṇavanadī kaivartakaḥ keśvaḥ",
    "verse_meaning": "Bheeshma and Drona were two banks, Jayadrada was the water, Sakuni the king of Gandhara was the blue lotus, Salya was the crocodile, Kripa was the tide, Karna was the mighty wave, Aswathama and Vikarna were the dangerous alligators and Duryodhana was the whirlpool, And the Pandavas crossed this river of war with Krishna as their helmsman."
  },
  {
    "verse_sanskrit": "पाराशर्यवचः सरोजममलं गीतार्थगन्धोत्कटं नानाख्यानककेशरं हरिकथासम्बोधनाबोधितम् लोके सज्जनषट्पदैरहरहः पेपीयमानं मुदा भूयाद्भारतपङ्कजं कलिमलप्रध्वंसनं श्रेयसे",
    "verse_trans": "pārāśaryavacaḥ sarojamamalaṃ gītārthagandhotkaṭaṃ nānākhyānakakeśaraṃ harikathāsambodhanābodhitam loke sajjanashaṭpadairaharahaḥ pepīyamānaṃ mudā bhūyādbhāratapaṅkajaṃ kalimalapradhvaṃsanaṃ śreyase",
    "verse_meaning": "Let the lotus flower of Mahabharata, which arose from the water, Which are the words of son of Parasara, which has the pollen grains of different stories, Which is taught in the form of stories of Lord Vishnu, That is drunk by the honey bee of very good people, Help those who want to remove the ills of Kali yuga (era)"
  },
  {
    "verse_sanskrit": "मूकं करोति वाचालं पङ्गुं लङ्घायते गिरिम् यत्कृपा तमहं वन्दे परमानन्दमाधवम्",
    "verse_trans": "mūkaṃ karoti vācālaṃ paṅguṃ laṅghāyate girim yatkṛpā tamahaṃ vande paramānandamādhavam",
    "verse_meaning": "I salute that Maadhava, the source of supreme bliss, whose grace makes the dumb man eloquent and the cripple cross mountains."
  },
  {
    "verse_sanskrit": "यं ब्रह्मा वरुणेन्द्ररुद्रमरुतः स्तुन्वन्ति दिव्यैः स्तवैर् वेदैः साङ्गपदक्रमोपनिषदैर्गायन्ति यं सामगाः ध्यानावस्थिततद्गतेन मनसा पश्यन्ति यं योगिनो यस्यान्तं न विदुः सुरासुरगणा देवाय तस्मै नमः",
    "verse_trans": "yaṃ brahmā varuṇendrarudramarutaḥ stunvanti divyaiḥ stavair vedaiḥ sāṅgapadakramopaniṣadairgāyanti yaṃ sāmagāḥ dhyānāvasthitatadgatena manasā paśyanti yaṃ yogino yasyāntaṃ na viduḥ surāsuragaṇā devāya tasmai namaḥ",
    "verse_meaning": "I salute him who is worshipped by divine chants by Brahma, Varuna, Indra, Rudra and Vayu. Who is pleased by singers of Sama Veda, by singing Vedas and Upanishads, by following the word sequence. Who is seen by yogis who are absorbed in him, with their mind merging in him, and whose end is not known even by the devas and asuras."
  }
]
